[
  "\"Notes\"",
  "\"Purportedly from Chimera only -- but no obvious fitting Monster tags.\\n\\nDivcord: Guardian of the Chimera itself verified by Zimzams (not from one of the other Monsters)\\n\\nThe most likely explanation is that A Familiar Call is part of Chimera's individual hardcoded Monster droptable, which we know is nonempty anyway given that Chimera always drops Fragment of the Chimera.\"",
  "\"\\nStill drops from The Hallowed Husk in Palace in 3.18\\nDivcord: Villa The High Templar verified by nennas\\n\"",
  "\"Divcord: Also dropped in Core by DSLily via a Kirac Card Mission\\n\\nDivcord: 3.14 Ultimatum archive showed drop from Primordial Pool boss as well\\n\\nBased on both these, likely also `malachai_boss_map`\\n\\n\\nNightmare's Omen => Primordial Pool\\nEater of Souls => Core\"",
  "\"Need verification on whether or not this drops in Maps (e.g. Gardens?)\\n\\nFrom Supporter Attribution post: \\\"I can't even tell you how many bird magazines I pulled out of our mailbox or how many plants she bought over the years. Even while she was sick, she started planting and maintaining strawberry plants in our backyard and even helped create a community garden.\\\"\\n\\nDoes not appear to drop in Terrace, which likely means it is story only\"",
  "\"If A Note in the Wind drops in Pillars of Arun, then it's `desert_area` instead of `desert_map_area`\\n3.20 re-verified in Dunes\"",
  "\"Could also be `desert_area`\\nDivcord: Desert Map verified by nennas\\n3.20 re-verified in Dunes\"",
  "\"Prim blocks verified in divcord\\n3.19: \\\"A Sea of Blue can now be found in the Grotto Map.\\\"\"",
  "\"Divcord: Peninsula verified\\nDivcord: 3.21, Geode verified by Zimzams\"",
  "\"level 68+; old claims were Arsenal, with hypothesis on `warehouse_area`\\nOnly Mao Kun has been verified in 3.18\\n\\nNeeds reverification in 3.18. Factory sample has produced 0 Abandoned Wealth so far, but might just be bad luck. Possible that this is now Mao-Kun-exclusive, unless someone can confirm Arsenal or Factory in 3.18.\\nDivcord: Aggregate natural Card drop count from T16 Factory is 565, zero instances of Abandoned Wealth.\\n\\nDivcord: Aggregate natural Card drop count from T16 Arsenal is 756, zero instances of Abandoned Wealth. Probability of occurrence: 0.23%.\\n\\nVery unlikely that Abandoned Wealth drops from either Factory or Arsenal anymore. Might be Mao-Kun-exclusive now.\"",
  "\"coolwaldo in Divcord claims it drops in Dry Sea (verified)\\nTebec verified Desert in Divcord. Does not appear to drop in Pillars of Arun, so likely desert_map_area over desert_area\"",
  "\"Divcord: 3.21, Alva Memory drop from an Architect, verified by Jasmine.\\nCandidate: `incursion_monster` - unlikely due to Akil's never dropping in stacks; likely more like Society's Remorse\\nThere are multiple Monster versions for Architects.\\nExample:\\nTacati, Architect of Toxins in Incursions OR Memory Line has `vaal_architect_incursion`.\\nTacati, Architect of Toxins in the Temple of Atzoatl has `vaal_architect_temple`.\\n\\nMaybe Akil's Prophecy is enabled by either of those Monster Tags?\\n\\nMaybe Alva Memories are using the \\\"wrong\\\" Monster, accidentally spawning the Temple version instead of the Incursion version? Seems like an easy mistake to make if a GGG dev overlooked the Tag differences.\\nDoesn't really make sense given the Monster naming conventions though; e.g. Tacati's version VaalArchitect1MemoryLine (which by name should be the one in Memories) has vaal_architect_incursion.\\nI guess we'd need to see an Akil's Prophecy drop in a non-Memory-Line Incursion to be more certain.\\n\\nDivcord: 3.21, an in-Map non-Memory Incursion drop of Akil's Prophecy verified by Zimzams.\\nThe most likely explanation then is that each of vaal_architect_incursion and vaal_architect_temple enable Akil's Prophecy.\"",
  "\"3.20: The Akil's Prophecy Divination Card has been re-enabled, and now awards a Double Corrupted Unique Elegant Round Shield. This card can now be found in the Temple of Atzoatl.\\nIs this an area drop or a monster drop?\\n\\nSee notes above; might be both `vaal_architect_incursion` and `vaal_architect_temple`.\\n\\n3.21: Unless we find evidence of this occurring as an Area drop in the Temple of Atzoatl (as opposed to strictly dropping from Architects), this is probably `vaal_architect_temple` instead of `incursion_temple_area`.\"",
  "\"Abyssal Trove\"",
  "\"No obvious Monster Tags for either \\\"Uhtred, Covetous Traitor\\\" or the dummy-object \\\"The Triskelion Flame\\\"\\n\\nSeems like another an example where a Monster-specific Card is tied to the Monster's drop table instead of a Monster Tag.\"",
  "\"Related to Pantheon and/or capturable souls; specifics unknown.\\nTwo leading options are:\\n(1) \\\"Kill a Boss of a Map which has `god_boss_map_area`\\\": a little unorthodox since `god_boss_map_area` is an *Area* Tag and the drop is Monster-specific, so the rule is oblique instead of the usual direct Tag association.\\n(2) \\\"Kill a Boss which has a Pantheon Capturable Soul, even if they are not on the Story Pantheon\\\".\\n\\nAn example that would support Option 1 is Gorulis, Will-Thief. We'd need a new verification of a drop from Gorulis in 3.18.\\nGorulis (1) is based on a Monster on the Story Pantheon; (2) is in a god_boss_map_area Area; (3) is *not* in PantheonSouls.dat; (4) *cannot* be captured in 3.18, though was capturable in the past.\\n\\nExamples that would support Option 2 are:\\nCaptain Clayborne, The Accursed; Puruna, The Challenger; Captain Tanner Lightfoot; Sebbert, Crescent's Point; Shock and Horror; Forest of Flames; Vision of Justice; The Infernal King; Pagan Bishop of Agony; The Cursed King; Lycius, Midnight's Howl; The Hallowed Husk; The Restless Shade\\nA drop from any of these Bosses would show that having a capturable soul enables the drop even without Story Pantheon presence.\\n\\nIt's also possible for both Option 1 and Option 2 to be true simultaneously.\\n\\n3.19: See More is Never Enough, above. This likely has the same conditions.\"",
  "\"3.21: Arrogance of the Vaal can now be found in the Vaal Pyramid Map.\\n\\nDivcord: 3.21, Vaal Pyramid verified by Zimzams as per patch notes.\\nVaal Pyramid did not receive any new Tags. Separate new governance added for Arrogance of the Vaal?\\n\\nCould this be related to how The Spoiled Prince is handled (The Fallen Queen?), which is likewise an Area drop isolated to Vaal Pyramid? Something else?\"",
  "\"Divcord: Park tested by nennas with high juice; zero drops of Assassin's Favour. Assassin's Favour is about ~0.78 the droprate of The Gambler, so seeing 0 drops of Assassin's Favour in this trial is extremely unlikely.\\n\\nThus Park is very likely no longer an eligible drop location for Assassin's Favour in 3.18\"",
  "\"Divcord: Stagnation as Kirac Mission by SlipperyJim\\nDivcord: Stagnation reverified as natural Area drop in 3.18.\\nLaboratory was explicitly patch noted in 3.18.\\n\\nwealthy_area, very low confidence (2/17)\\n\\nMaybe `relic_area`? (EDIT: No, see below.) Laboratory is weird in that it seems to inherit Tag properties without having those Tags, similar to Necropolis. (Museum)\\n\\nPossible naming theory - check azyran's reward thread under #general on divcord (Malformation, Racecoure, Primordial Blocks)\\n\\nCould also be `mausoleum_area` (Mausoleum, Sepulchre) or based on The Reliquary tilsets only (disprove all other theories)\\nDM from card creator\\n\\nDivcord: 3.20, Shrine: Zimzams tested >500 natural Card drops, zero Azyran's Reward. This disproves `thaumaturgy_area` as a sole factor with >99% confidence.\\nDivcord: 3.20, Museum: Zimzams tested 1034 natural Card drops (on top of a prior n=340 sample) zero Azyran's Reward. So `relic_area` cannot be the sole governing factor.\"",
  "\"Divcord: Desert verified by Jasmine\"",
  "\"Atziri Trio\\nQ'ura / Y'ara'az / A'alai\\nNo Tags; likely Monster-specific drop table\"",
  "\"mine_area ? or cave_area?\\n\\nDivcord: Zimzams verified Dig which has `mine_area` but not `cave_area`\\n(Possible that it's still both Tags, though.)\\n\\nExcavation verified on divcord\\nVerifications needed for `mine_area`:\\n{Geode}\\n3.20 patch notes: Added Grotto\\n\\nDivcord 3.21: Geode verified by sokratis12GR\"",
  "\"drop disabled\"",
  "\"drop disabled\"",
  "\"Conservatory observed by SlipperyJim8 as a Kirac Mission drop\"",
  "\"Divcord: nennas reverified this in 3.18 in Pit of the Chimera as an Area drop (not Boss)\\n\\nShaper Guardian Maps seem to work like Unique Maps in that they have Area-specific natural Card drops which do not depend on Tags.\"",
  "\"Divcord: fal claims Boundless Realms drops in Cold River (confirmed)\\n\\nNeed to see if the wiki claim of Ivory Temple is still accurate\"",
  "\"Needs many Boss verifications before being seriously considered\\n\\nDivcord: 3.20 Mirage of Bones verified by Jasmine\\n3.20 Steelpoint the Avenger verified by RiPHeartofGold\\n3.20 Stonebeak, Battle Fowl verified by RiPHeartofGold\\n\\nEffigy of the Wilderness (Kalandra)\"",
  "\"Tolman, the Exhumer verified in divcord\\n\\n3.21: Broken Promises can now be found in the Core Map.\\npreviously specific to \\\"Tolman, the Exhumer\\\"; map tags seem unlikely as mausoleum_area also includes Relic Chambers and Sepulchre. More likely, \\\"Eater of Souls\\\" (Malachai) is likely to be the new source, referencing his relationship with Dialla and turning into a monster.\\n\\nDivcord 3.21: Core Boss verified by Wudo (albeit via an Elder Guardian replacement; this still confirms Eater of Souls though)\"",
  "\"Grave Trough confirmed in divcord\"",
  "\"Droprate is low: worse than The Nurse, about the same as Alluring Bounty\\n\\nDivcord: nennas posted a video of a drop in Orchard from a Strongbox with a Rogue Exile. Natural drop? Deterministic drop?\\nChateau and Orchard both share `labyrinth_tileset_area`, could this be the correct Tag? If so, then need verifications in Conservatory\\n\\nDivcord: Plaza verified by nennas\\nDivcord: 3.21, Conservatory verified by Zimzams\"",
  "\"Verified from Headmistress Braeta in Putrid Cloister, though since she drops lots of random Cards anyway, difficult to distinguish from generic drop\\n\\nDivcord: 3.19, Erythrophagia verified by Zimzams\\nDivcord: 3.20, Prodigy of Hexes (Core Map) verified by Zimzams\"",
  "\"3.20 patch notes: Added Grotto\"",
  "\"Divcord: Dark Forest verified by Zimzams\\n\\nIf someone verifies a drop in Lair, that would indicate `rigwald_area`\\nCould also be `dark_forest_area` but less likely given theme\\n\\nDivcord: In 3.19, CommissarTyr tracked 4 Call to the First Ones in Bramble Valley, which implies `dark_forest_area` is probably correct; remaining to verify: none\\n\\nDivcord: Thicket verified. Might also key off of `thicket_area` ? Thicket has `forest_map_area` but not `dark_forest_area`.\\n\\nDivcord: Forbidden Woods verified 3.19\"",
  "\"Divcord: Verified that `thicket_area` permits Call to the First Ones, but does NOT permit other `dark_forest_area` Cards. Thus `thicket_area` does not inherit `dark_forest_area`. Call to the First Ones is simply governed by two separate Tags.\\n3.21: Krolya verified Dread Thicket A7.\"",
  "\"Story Only? Former drop location was The Docks (Merciless).\\nProbably has Drop Level Cap\\n2022: Cartographer's Delight, significantly nerfed (was: ~Lantador's Lost Love ; now: ~The Witch)\"",
  "\"Can this drop in Shrine? If so, maybe lunaris_blood_area\\nLess likely: thaumaturgy_area\\nIf not, then restricted to Poorjoy's Asylum as an Area-specific drop (most likely)\\n\\nDivcord: Zimzams's testing on 2022/07/30 is likely already sufficient to disprove this in Shrine.\\nThe most likely case is that Chaotic Disposition is constrained to Poorjoy's Asylum only.\\nDivcord: Zimzams tested another Shrine sample on 2023/01/10; still zero Chaotic Disposition.\\n\\nFor now marking this as conclusively tied to Poorjoy's Asylum only.\"",
  "\"Previously uncertain if drop was due to Reliquary Map vs Redeemer influence\\n3.19: verified in Museum (Exarch) - likely relic_area instead (may require repeat testing to be sure)\\n3.19: Verified in Museum in a Kirac mission (no Influence) by Zimzams\"",
  "\"The reason this association was not marked \\\"Done\\\" is that Bone Crypt is the sole Map with catacomb_area currently, so we can't test the hypothesis of the Tag association in Maps. We'd need to see at least one more Map with catacomb_area other than Bone Crypt in which Coveted Possession drops to be more confident that the association is correct. But no such Map exists currently.\\n(The pattern seems to hold true for Story Areas, though.)\\n\\nFor example, eligibility could be governed by some other non-Tag aspect shared by Bone Crypt and the Story Areas (true of a small number of other Cards), but we have no way to distinguish that right now.\\n\\nOne could argue that the Story evidence is sufficient to mark this Done, though.\"",
  "\"Needs verifications to distinguish between cemetery_map_area and graveyard_area; graveyard_area more likely\"",
  "\"Delve chest item\"",
  "\"Appears to drop from any source of Delirium Currency rewards\"",
  "\"Seems to be specific Poorjoy's Asylum. Unique Maps can have Area-specific drops.\"",
  "\"*In order for this card to drop in The Karui Fortress, you require a strongbox with +5 to level of items. (46 -> 51)\"",
  "\"unknown if this drops from Act 5 Innocence\"",
  "\"red herring from Kurgal was corrected, delve_vaal_boss (all three bosses) seems unlikely\"",
  "\"Basilica\\n\\nPretty uncommon, about the same droprate as The Nurse or The Scout\\nPlayerbase's farming in Crimson Temple rules out `church` -- it should have dropped there by now.\\n\\n\\nOne possible explanation:\\nNot a Boss-specific drop, but keyed off of a Boss's Monster Tag? \\\"Drops in any Areas where Boss has innocence_map\\\"?\\n\\nThere are a couple of other candidates that follow that potential pattern, where there is not an appropriate Area Tag, but the Card is nevertheless predictable based on qualities of the Boss.\\n\\n3.19: \\\"Desperate Crusade can now be found in the Residence Map.\\\" desperate crusade only previously was confirmed in Basilica. only lead was innocence_map. Palace was removed, so Villa should be tested to check sceptre_of_god_area (1/3); otherwise, Tower needs to be tested in Standard (1/2). If nothing else, check for new 3.19 tags\\n\\n\\nCould this follow the same weird rules as The Golden Era? If so, Ivory Temple needs to be checked.\\nDivcord: 3.22, Elinvynia checked n=928 natural Card drops in Ivory Temple, 0 hits; ~99.82% confidence.\"",
  "\"Divcord: Temple verified by Zimzams\\nDivcord: Cold River verified by Zimzams\\n\\nDivcord: Moderate evidence from Ivory Temple testing that Dialla's Subjugation no longer drops here\\n3.21: Harbour Bridge verified by Elinvynia\\n3.22: Solaris Temple 2 (Act 8) verified by Elinvynia\"",
  "\"The Maven's Crucible Event Completion loot\"",
  "\"No longer drops in Defiled Cathedral (tested in 3.19 with n>1000 non-global natural Card drops). \\n\\n3.19 sampling from RiPHeartofGold and Zimzams showed zero drops in Orchard as well.\\n\\nIt's possible that the sole drop location is now Armourer's Strongbox, but it may have a natural drop location somewhere still.\\n\\nDisproved in Chateau with 367 natural card drops; not labyrinth_tileset_area.\\n\\nVewrified Armourer's Strongbox in Bog and Arsenal, no shared tags.\"",
  "\"3.20: Natural weight similar to The Dragon's Heart; likely Boss-specific though (since it hasn't been reported in any Area yet), and Boss-specific drops ignore natural weights\"",
  "\"Can this occur from Architects outside of the Temple of Atzoatl, e.g. from Alva Memories or Incursions?\\n\\nAkil's Prophecy is similar, and can in fact appear outside of the Temple of Atzoatl. See Akil's Prophecy notes above.\"",
  "\"Divcord: Precinct verified by fal\"",
  "\"Confirmed to drop in the Feared. Unclear if tied to one of the bosses or not\"",
  "\"Divcord: Dry Sea verified by Zimzams\\nPillars of Arun verified by Elinvynia\"",
  "\"maligaro_area ? chamber_of_sins_area ? both?\\nOvergrown Shrine verified in divcord\\nneeds verification\\n\\nmight be both: \\n{`chamber_of_sins_area` + `maligaro_area`}. \\n\"",
  "\"Divcord: clip of Lighty posted by Zimzams shows drop in Museum\"",
  "\"Divcord: verified in Overgrown Ruin by Zimzams via a Kirac Card Mission\\n\\nIs the old wiki Fungal Hollow claim still accurate? Doesn't mesh with `chamber_of_sins_area`\\n\\nDivcord: nennas tested Fungal Hollow; with that sample, zero Emperor of Purity observed; probability this would occur by chance is ~1.7%. Unlikely to drop in Fungal Hollow anymore. It's probably safe to call this one done and revisit only if we're surprised by a Fungal Hollow drop in the future.\"",
  "\"Gardens observed by SlipperyJim8 as a Kirac Mission drop\"",
  "\"The Cursed King\\n\\nUnconfirmed: Could this also drop from Lycius, Midnight's Howl in Lair Map?\"",
  "\"Map Reward Heist Chests\"",
  "\"Currently no sightings reported from Lunaris themed bosses even in maps where both are present (Cold River, Twilight Temple)\"",
  "\"drop disabled\"",
  "\"Caldera Verified in Divcord\\nDivcord: Shore verified by ColdMamba\\nLava Lake verified by DabIt\\nDivcord: 3.20 Coves verified by Jasmine\\nDivcord: 3.20 Estuary verified by fal\\nDivcord: 3.20 Volcano verified by Zimzams\"",
  "\"Vault verified on divcord\\nDivcord: Foundry verified by RiPHeartofGold 3.19\\n\\nRemaining to verify:\\n{Laboratory}\"",
  "\"maybe lunaris_outer_area ?\\ncould be a different shared Tag between Colonnade, Promenade\"",
  "\"Dig - Garukhan specific?\\n3.20 patch notes: Added Grotto\\npossibly mine_area as Grotto newly gained mine_area?\\n\\n3.21 Geode verified by RiPHeartofGold\\n3.21 Crystal Ore verified by CardboardMonka\\n3.21 Flooded Mine verified by RiPHeartofGold\\n3.21 Excavation verbally confirmed by Peepo\"",
  "\"3.20 patch notes: Added Grotto\\nThe Quarry and The Tunnel no longer eligible due to drop level\"",
  "\"Divcord: Coward's Trial verified by Zimzams\\nZimzams mentioned a drop from Kirac Card Mission in Necropolis\\n\\nZimzams hypothesizes: \\\"Similar to The Forsaken, maybe `crypt_area` + `necropolis`? \\\"\\n\\n\\nStill eligible to drop in Olmec's Sanctum in 3.18?\\nIf so, then it needs another row for an Area-Specific Drop\"",
  "\"New tag eligibility discovered by Elinvynia in 3.21 - The Ossuary (Act 10).\\nDivcord: 3.21, A3 The Catacombs verified by Elinvynia\\nDivcord: 3.21, A5 The Ossuary verified by Elinvynia\"",
  "\"Divcord: Coward's Trial verified by Zimzams\\nZimzams mentioned a drop from Kirac Card Mission in Necropolis\\n\\nZimzams hypothesizes: \\\"Similar to The Forsaken, maybe `crypt_area` + `necropolis`? \\\"\"",
  "\"Kirac shop\"",
  "\"tag appears to be for maps, though card drops from the bosses\\n\\nRule would be:\\n\\\"Drops from a Map Boss in an Area with `trio_soul_area`\\\"\\n\\nThis rule is similar to the rule for The Arena Champion\"",
  "\"Twilight Temple -- but if this is keyed to e.g. \\\"both solaris_area + lunaris_area\\\", then Cold River might comply too\\n\\nDivcord: 3.19, kroIya sampled 593 natural Card drops in Cold River, finding 0 Haunting Shadows\\n\\nSeeing zero Haunting Shadows in 593 natural Card drops would have been 99.8% confidence that Haunting Shadows does not drop in Cold River in 3.18 -- but we don't know if Haunting Shadows's weight was nerfed in 3.19 (this is possible since it rewards a Unique Item category, and certain other Unique Item category Cards did indeed have their weights nerfed if the set of Tiers of their respective possible Unique Item outcomes were overall nerfed as well). \\nThat said, unless we learn in the future its weight was indeed heavily changed, this is probably sufficient evidence that Haunting Shadows is exclusive to Twilight Temple (i.e., as part of its Unique Map Card eligibility table).\\n\\n3.21: Elinvynia provided a 98% confident sample of no Haunting Shadows in Cold River. Concluding this card as a unique map only card.\"",
  "\"Global Drop\\n\\nHas Drop Level Cap\"",
  "\"fire_area + a water tag? Need to test Lava Lake if so.\\nIf suspecting just dual element bosses, perhaps Plateau, Residence, Shrine Piety?\\nVerified Twilight Temple on Divcord\\n\\nSumter the Twisted in Estuary has Tags including `cold_affinity`, `fire_affinity`, `physical_affinity`.\\nHypothetically, if the rule implied by Sumter the Twisted in Estuary is \\\"Natural drop in an Area whose Boss has `cold_affinity` and `fire_affinity`\\\", then these might also be leads:\\n* Coral Ruins: Captain Tanner Lightfoot (cold_affinity, fire_affinity, physical_affinity)\\n* Maze: Shadow of the Vaal (cold_affinity, fire_affinity, lightning_affinity)\\n* Acid Caverns: Morgrants, The Deafening (cold_affinity, fire_affinity, lightning_affinity, physical_affinity)\\n(But we don't know if this guess is correct. If it is, Coral Ruins would probably be the closest fit.)\\n\\nDivcord: 3.20, zero hits in Coral Ruins with n=115. This sample gives ~98.95% confidence that Heterochromia is not a natural Area drop in Coral Ruins. That means the condition \\\"Drops in an Area whose Boss has both cold_affinity and fire_affinity\\\" is not sufficient alone.\\nDivcord: 3.20, zero hits in Plateau with n=143, ~99.6% confidence. That means the condition \\\"Drops in an Area with at least two Bosses with different elemental affinity Tags\\\" is not sufficient alone.\\nDivcord: 3.20, zero hits in Lava Lake with n=81, ~99.5% confidence. That means the condition \\\"`fire_area` + a water Tag\\\" is not sufficient alone.\"",
  "\"Ancient City verified in Divcord\\nChateau verified by RiPHeartofGold in Divcord\\nDivcord: 3.20 Haunted Mansion claim by both reh and Superlight (no screenshot)\\nDivcord: 3.21 Siege verified by RiPHeartofGold\"",
  "\"No Tags fit all wiki claims. Need to check wiki claims.\\nDropped in Frozen Cabins and Strand - current version's T1 maps. Maybe drop level cap of 68?\\n\\n\\\"MapAtlasArcade, MapAtlasCrystalOre, MapAtlasDesert, MapAtlasJungleValley, MapAtlasGrotto, MapWorldsBeach, MapWorldsLookout, MapWorldsDungeon, MapWorldsGraveyard, MapWorldsJungleValley\\\" was removed by Jasmine. Almost all of these maps should have been historically t1 or t2 maps, however not global drop. Perhaps drops change each series?\\n\\nNeeds verification in Overgrown Ruin and Terrace, and disproved in t2 maps to confirm.\\n\\nIn 3.20, confirmed in Terrace (t1), making a 68-68 drop cap likely\"",
  "\"Note that the Drop Level Requirement is 75, so only Alluring Abyss qualifies (not Apex of Sacrifice)\"",
  "\"Divcord: nennas tested Fungal Hollow and never observed Hunter's Resolve. (Expected: 20; Sample Actual: 0). We can state with very high confidence that Hunter's Resolve no longer drops in Fungal Hollow.\\n\\nDivcord: Story A6 The Southern Forest verified by Jas 3.19\"",
  "\"previously was hypothesized as `cave_area`\\nDivcord 3.20: Lars024 tested Lair with n=823, zero instances of Hunter's Reward; >99% confidence that Hunter's Reward is not eligible in Lair, which if true would rule out cave_area. That makes the claim of Hunter's Reward occurring in Underground River unusual (Underground River has only cave_area).\\nWe probably need to check if those prior claims are false now, and we probably need a completely new Tag hypothesis for Hunter's Reward.\\n\\nAnother hypothesis: \\\"Drops in an Area whose Boss has `ursine_beast`\\nMap Areas with a Boss with ursine_beast: Barrows (Beast of the Pits) Bramble Valley (Melur Thornmaul) Cemetery (Erebix, Light's Bane) Underground River (It That Fell)\\nFalsified using Cemetery Map in 3.20 (n=523); so this cannot be it either\\n\\nRe-testing Grotto in 3.20, zero hits of Hunter's Reward in n=1613 Cards; conf ~96%.\\n\\nBest guess based on Jasmine's research is a Boss-specific drop from `bestiary_spirit_boss` Monsters, i.e. Farrul/Fenumus/Craiceann/Saqawal.\\nExample drop from Fenumus: https://www.reddit.com/r/pathofexile/comments/dcekvf/pretty_sure_about_hunters_reward_drop_location_is/\\nIn Legacy League, it was observed dropping in a standalone Tora Mission area (Putrid Lair): https://www.reddit.com/r/pathofexile/comments/5xi3h5/hunters_reward_can_drop_during_tora_missions/\\n\\nNeeds to be verified for current patch\"",
  "\"Previously this was a Boss-specific drop from Amalgam of Nightmares in Carcass; still true?\\nAn old wiki note also claims Vault -- true or false?\\nReverified Immortal Resolve from Amalgam of Nightmares (Carcass) in 3.19\"",
  "\"3.21: Immortal Resolve can now be found in the Crystal Ore Map.\\nAmalgam of Nightmares + Crystal Ore's trio makes me suspect a \\\"linked boss\\\" theory. Will need to check if there are any suspicious tags; Amalgam has unholy_trio_combined_boss_map \\nThe new Monster Tag unholy_trio_boss_map is applied to only these Monsters in Crystal Ore: {Lord of the Hollows, Messenger of the Hollows, Champion of the Hollows}\\nZimzams verified Champion of the Hollows in 3.21\"",
  "\"level 80+\\nPillars verified in divcord\"",
  "\"Divcord verified in collonade\\nSolaris Concourse, The Battlefront, The Marketplace, The City of Sarn verified by Elinvynia (3.21)\\nDisproved in The Imperial Fields with 99% confidence\"",
  "\"Conquerors; Four separate Boss-specific Tags since `elderslayer` does not appear to be correct as no drop has been verified from Sirus (who also has `elderslayer)\"",
  "\"Conquerors; Four separate Boss-specific Tags since `elderslayer` does not appear to be correct as no drop has been verified from Sirus (who also has `elderslayer)\"",
  "\"Conquerors; Four separate Boss-specific Tags since `elderslayer` does not appear to be correct as no drop has been verified from Sirus (who also has `elderslayer)\"",
  "\"Conquerors; Four separate Boss-specific Tags since `elderslayer` does not appear to be correct as no drop has been verified from Sirus (who also has `elderslayer)\"",
  "\"verified in Divcord\\nhttps://discord.com/channels/834368692560461846/990692208191627334/990817747002884196\"",
  "\"`church` ?\\nBasilica and Defiled Cathedral were drop locations in 3.15 -- but are they still both eligible after the 3.17 rework?\\nBasilica verified in divcord\\nDefiled Cathedral confirmed in divcord\"",
  "\"Shipyard observed by SlipperyJim8 as a Kirac Mission drop \\nWhakawairua Tuahu, mao kun, beach, Shore, Peninsula drop in divcord \\nThe verification in Beach confirms this is `ocean_area` and not `map_area_with_open_water`, since Beach has the former but not the latter. \\n\\nDivcord: Estuary, Tropical Island, Lighthouse, Pier, Plateau, Wharf, Coves verified by Zimzams\\n3.19: \\\"The Formless Sea can now be found in the Strand Map and the Whakawhairua Tuahu Unique Map.\\\" - no changes\\nMud Flats verified by Elinvynia.\"",
  "\"vaal_pyramid_area ?\\nIf so, many more Maps need to be verified\\n\\nDivcord: Verified in Vaal Temple natural drop sample\\nMay be exclusive to Vaal Temple\\n\\n\\r\\nPer Elinvynia 3.22: \\\"Last Hope card definitely doesn't match the `vaal_pyramid_area` hypothesis. My sample in Vaal Pyramid (919 cards) disproves it there. And since Vaal Pyramid and Vaal Temple pretty much share all tags, I would say it is fair to say it is exclusive to Vaal Temple.\\\"\"",
  "\"Divcord: Ramparts verified\\nDivcord: Forking River verified\"",
  "\"Kirac shop\"",
  "\"Divcord verified Caer Blaidd, Wolfpack's Den\"",
  "\"drop disabled\"",
  "\"T7 Maps Only\\nArea-specific Drop\\n3.21 verified a drop from an Incursion in a t5 map, confirming that drop level caps (and drop levels) are dependent on the drop source rather than the area level.\"",
  "\"This might be `merveil_area` instead of `sea_witch_boss_area`, if Mineral Pools cannot actually produce Lysah's Respite. (Mineral Pools cannot produce The Lover which was erroneously tagged to Mineral Pools as well. But this one might be different. More testing needed in Mineral Pools -- lowish dropweight.)\\n\\nUpdate:\\nDoes seem to be `merveil_area`: Zimzams did an n=65 sample in Lava Chamber (which has `sea_witch_boss_area` but not `merveil_area` and observed 0 Lysah's Respite. Likelihood is ~0.0012.\\n\\nThis implies we should also fail to see Lysah's Respite in Mineral Pools, contrary to the old wiki claim.\\n\\nUpdate:\\nDivcord: Mineral Pools tested by nennas, n=192, 0 Lysah's Respite. This is sufficient to rule it out with high confidence.\"",
  "\"Drops from Synthesis Maps\\n\\nCortex has `synthesis_area` as well, but no verified drop here yet in 3.18\"",
  "\"Divcord: Arsenal verified by nennas\\nDivcord: Promenade verified by RiPHeartofGold 3.19\"",
  "\"Divcord: fal verified drop in Cold River\\nDivcord: Glacier verified\\nVerified in The Descent (A9)\"",
  "\"Appears to once again drop in various Unique Maps\"",
  "\"Seems like this might match Ambitious Obsession ?\\nDivcord: Sunken City Boss drop, as expected by Armala, the Widow; Reef Boss drop, as expected by Nassar\\n\\nRelated to Pantheon and/or capturable souls; specifics unknown.\\nTwo leading options are:\\n(1) \\\"Kill a Boss of a Map which has `god_boss_map_area`\\\": a little unorthodox since `god_boss_map_area` is an *Area* Tag and the drop is Monster-specific, so the rule is oblique instead of the usual direct Tag association.\\n(2) \\\"Kill a Boss which has a Pantheon Capturable Soul, even if they are not on the Story Pantheon\\\".\\n\\nAn example that would support Option 1 is Gorulis, Will-Thief. We'd need a new verification of a drop from Gorulis in 3.18.\\nGorulis (1) is based on a Monster on the Story Pantheon; (2) is in a god_boss_map_area Area; (3) is *not* in PantheonSouls.dat; (4) *cannot* be captured in 3.18, though was capturable in the past.\\n\\nExamples that would support Option 2 are:\\nCaptain Clayborne, The Accursed; Puruna, The Challenger; Captain Tanner Lightfoot; Sebbert, Crescent's Point; Shock and Horror; Forest of Flames; Vision of Justice; The Infernal King; Pagan Bishop of Agony; The Cursed King; Lycius, Midnight's Howl; The Hallowed Husk; The Restless Shade\\nA drop from any of these Bosses would show that having a capturable soul enables the drop even without Story Pantheon presence.\\n\\nIt's also possible for both Option 1 and Option 2 to be true simultaneously.\\n\\n3.19: Jasmine verified a drop from Khor, Sister of Shadows in Cold River who is NOT capturable (though Ara, Sister of Light is). This proves that \\\"capturability\\\" is not a requirement.\\n\\n3.19: Observed in an Atlas Memory Cemetery Map, not from Boss -- could Atlas Memories behave differently? - confirmed.\"",
  "\"Vault was added as a separate area in 3.16, inconsistent in theme with the pantheon bosses but fits the theme of \\\"greed\\\".\\nNo clear tags - does not included \\\"Pirate Treasure (Coves)\\\", and not gold_pile_area+wealthy_area as not found in Vaults of Atziri.\"",
  "\"Parasitic Passengers is an Area drop, but unclear how this is governed\\n\\n* The Winged Death : VultureParasiteMapBoss\\n* Gorulis, Will-Thief : InsectSpawnerParasiteBossMap\\n\\nThe Hallowed Husk could be considered a demonic parasite? Needs drop confirmation\\n3.19: \\\"Parasitic Passengers can now be found in the Arachnid Tomb Map\\\". Hybrid Widow also lacks Parasite in internal name, but uses a skill called \\\"Covered in Spiders\\\"\\nReverified Channel in 3.20\\n\\nThe Winged Death's summoned Monster is named \\\"Mindless Scavenger\\\" variant (`VultureParasiteMapBossMinion`).\\nHybrid Widow's summoned Monster is named \\\"Widow's Hatchling\\\", `SpiderBossSinsMinion`.\"",
  "\"Divcord: Terrace verified by Zimzams\\nDivcord: Orchard verified by RiPHeartofGold 3.19\"",
  "\"Redeemer influenced maps\"",
  "\"karui_map but not beach?\\n\\nDivcord 3.20: Zimzams tracked n=1970 in Coves with zero hits of Pride Before the Fall, sample confidence >99%. Coves has `karui_map`.\\n\\nThe old claims of Pride Before the Fall in {Caldera, Volcano, Lava Lake} seem to be from 2018 or earlier. Do we have modern reverifications?\\nPossible alternatives:\\n* If Lava Lake is still eligible, maybe both `kaom_area` and `kitava_area`?\\n* If Lava Lake is not eligible anymore, maybe only `kaom_area` (and therefore only Caldera and Volcano)?\\n\\n3.20: Partial T16 Lava Lake sample, n=521, zero hits of Pride Before the Fall, current confidence ~91%. Needs more testing to have better certainty, but this may be more evidence of simply `kaom_area`.\\nUpdate: Zimzams added +484 trials; new confidence >99%.\\n\\nResult: Seems like it's simply `kaom_area` and nothing else.\"",
  "\"Reported dropping by krolya in Caer Blaidd in divcord. A direct verification would be beneficial.\"",
  "\"Mao Kun verified in Divcord\\nWharf verified in Divcord\\nBeach verified in Divcord\\nWhakawairua Tuahu verified in divcord\\nCoral Ruins verified in Divcord\\nReef verified in Divcord\\nAtoll verified in Divcord\\nMaelstrom verified in Divcord\\nTropical Island verified in Divcord\\nAll verified in Divcord: {Lighthouse, Plateau, Shipyard, Pier, Coves}\"",
  "\"Gardens verified per Divcord\\nDivcord: Orchard verified by Zimzams\\n\\nDrop level limit of ilvl 80\"",
  "\"3.21 - disproved Rats 99% in Imperial Fields\"",
  "\"Has a Drop Level Requirement of 23.\\nImplicitly has a Drop Level Cap, based on Charan's comments, at least somewhere as high as Act 10.\\n\\nCharan states:\\n\\\"Drops from: *most core zones in parts 1 and 2* (nothing sealed like the belly of the beast or otherworldly like Maligaro’s Sanctum. Basically, anywhere ‘in’ Wraeclast.)\\\"\\n\\nLong term project due to numerous locations and low drop rate. otherworldly_story_area is likely the NOT tag, which includes the following:\\n\\nKaom's Dream, Kaom's Stronghold, Daresso's Dream, The Grand Arena, The Belly of the Beast Level 1/2 (Act 4), The Harvest, Maligaro's Sanctum, The Belly of the Beast (Act 9), The Rotting Core\"",
  "\"Divcord 3.19: Iron reports a drop from General Marceus Lioneye in a Map Legion Monolith, but the drop occurred while Lioneye was still in Stasis.\\n\\nDatamining shows that Legion Generals (but not other Legion Monsters) do in fact have a special item drop eligibility override while in Stasis.\\n\\nIf this is the deterministic drop source of Rebirth and Renewal, either the hardcoded droprate is extremely low, or another condition needs to be met.\\n\\nSo far Iron's case is the sole report of Rebirth and Renewal despite lots of players running Legion. A drop from Legion is in-theme with the Card; when a Legion Monster leaves stasis, it's called \\\"LegionRevive\\\".\"",
  "\"Iron reports:\\n\\\"It was specifically from Light Jewellery chests in Primeval Ruins only. It was quite rare, I only completed 1 set and change in 10k depth\\\"\\nLight Jewellery Chest in Abyssal City confirmed. May be difficult to prove due to the nature of Div Card Chests\\nVerified in Vaal Outpost as well by NcuriousmediatoR\"",
  "\"Dunes\\nRequires more verifications; maybe desert_map_area ?\\nSeems to be specifically flavoured for Hillock\"",
  "\"Previously DONE in 3.18\\r\\n3.19: \\\"Scholar of the Seas can now be found in the Strand Map and the Whakawhairua Tuahu Unique Map.\\\"\\r\\nNeeds check if these maps have ship_graveyard_area tag. If not, may be manual\"",
  "\"Crimson Temple well known.\\nDefiled Cathedral confirmed on divcord per Sirgog\\nPossible Sepulchre but unclear if Altar or not - link\\nLookout disproved to 99.9% - disproves kitava_cultist_area; pivot theory to blood_mage_boss_map instead?\\nWas the Desecrated Chambers drop actually observed?\"",
  "\"Overgrown Ruin verified in Divcord by Tebec\\n\\nPossibly `maligaro_area` + `chamber_of_sins_area`?\\nNo: `maligaro_area` disproved in 3.20. The historical drop location of Museum is no longer true.\\n\\nDivcord: 3.20, Zimzams observed zero hits of Shard of Fate in Core with n=34. Nennas previously tested and observed the same.\\nThis implies the Museum claim is unexpected as well.\\nThe claim of Shard of Fate dropping in Museum seems to date back to Jan 2018, very stale.\\nDivcord: 3.20, Shard of Fate no longer drops in Museum (n = 340, confidence >99.999%).\\n3.21: Verified in Chamber of Sins Level 1 (Act 7).\"",
  "\"Drops from Farrul in Farrul's Den.\"",
  "\"Voltaxic Sulphite\"",
  "\"drop disabled\"",
  "\"Stagnation observed by SlipperyJim8 as a Kirac Mission drop\\nVinktar Square verified in divcord\"",
  "\"\\\"construct\\\"? not searchable on poedb due to common Tags being ignored in search\\n\\nMaybe Unique Monster + `construct`\\n\\nMost appear to be a form of Golem monster type\"",
  "\"Reddit claims it drops in Academy\\nDivcord 3.20: Zimzams verified Academy\\n3.21 Zizmzams verified Scriptorium\"",
  "\"Other vaal Tags may qualify as well\\nAncient City Verified in Divcord \\nSunken City will need testing to differentiate between ruined_vaal_city_area or vaal_ruin_area\\n\\nSunken City testing by Jas and Zimzams showed no The Admirer drops, which means `ruined_vaal_city_area` is not sufficient\\nVaults of Atziri verified in divcord\\n\\n3.20: Doryani's Machinarium verified by NcuriousmediatoR\"",
  "\"Ancient City Verified in Divcord \"",
  "\"Vaults of Atziri\"",
  "\"Possible parallel to The Depraved Trinity due to it being eligible from Amalgam of Nightmares?\"",
  "\"3.20 patch notes: Added Carcass\"",
  "\"level 75+\\nCrimson Township, Defiled Cathedral verified in divcord\\n\\nDivcord: 3.20 Haunted Mansion verified by Dampin via Snap OW and Superlights\"",
  "\"Speculative claims of Invasion monsters\\nDivcord post of a Chayula Breachstone, pre-Boss\\nDivcord: 3.20 Uul-Netol Breachstone posted by Stymphalian ID.27, pre-Boss loot explosion at end of Arena\\n\\nBreachstone Areas all have the Tag `breach_map`. Maybe that's a factor. Or perhaps there's a deterministic chance for it to drop as part of the loot explosion.\\n\\n3.21: Isolated drop in Esh Breachstone noted by Jasmine (1x The Archmage's Right Hand, 2x The Realm, no other cards); no Div card reward modifiers or incubators opened. May need to investigate in Xoph/Tul Breaches; may be a drop across all Breachstones.\\n\\nDvicord: 3.21, Elinvynia counted Active Skill Gems in Breachstones and proved that The Archmage's Right Hand is a deterministic drop (not a natural drop).\\nDivcord: 3.21, Xoph's Domain and Tul's Domain verified by Elinvynia\\n\\nDeterministic drop in all `breach_map` Areas (Breachstones)\"",
  "\"Besides the wiki's claim of Guardian of the Chimera, can this also be obtained in Areas? Some legacy pitfight_area Areas are on the wiki:\\n{Arena, Pit, Colosseum, Pit of the Chimera}\\n\\nDivcord: Pit verified by Zimzams, but unknown if it is a Boss drop from Olof, Son of the Headsman (confirmed boss by nennas)\\n\\nDivcord: Arena verified by Zimzams, from Boss\\nDivcord: Colosseum verified by Zimzams, from Boss\\n\\nCondition seems to be:\\n\\\"Defeat Map Boss in a `pitfight_area` Area\\\"\"",
  "\"Need to prove/disprove Act 8 Lunaris temple to determine if the tag is 'lunaris_blood_area\\\" alone, or \\\"lunaris_blood_area & thaumaturgy_area\\\"\\nVerified Lunaris Temple Level 2 (Act 8), ruling out need for thaumaturgy_area\"",
  "\"Zimzams believes it might have dropped from a regular Laboratory heist monster, but low confidence regarding it. Would need better report to disprove this\\nAnother drop reported by Jasmine in a Prohibited Library blueprint. Unable to verify corpse, but appeared to have a staff-like weapon with a rounded end (Flesh Sculptor?)\"",
  "\"Mineral Pools verified in Divcord\\nUnderground Sea verified in Divcord\\nDivcord: Lava Chamber verified by Zimzams\\nDivcord: Maelström of Chaos verified by Zimzams\\nDivcord: 3.20, Whakawairua Tuahu verified\"",
  "\"Reverified Caldera and Volcano in 3.21\"",
  "\"Verified Boss drop.\\nsecond form of Konley, the Unrepentant (Basilica). Reference to Ungnyeo myth?\\n3.19 patch notes: Added Barrows\\n3.20 patch notes: Added Cemetery\\nThese maps correspond to bear_boss_map with high confidence.\"",
  "\"Story only? \\\"belly_area\\\"? or perhaps \\\"belly_area, NOT harvest_area\\\"?\\nAppears level capped for story zones\"",
  "\"Castle Ruins verified in divcord.\\nThe Ashen Fields verified in divcord.\\nWiki previously had \\\"The Crossroads, The Northern Forest, The Riverways, The Southern Forest, The Western Forest (Act 6/7)\\\" however these do not seem current. Removed for now.\"",
  "\"Manually added to Oshabi in 3.16; however previous location was not found at the time. See below\\nProhibited Library: CardPender 3.20 dropped 1 Bitter Blossom from Oshabi over n=200 kills.\"",
  "\"Original source for this card was missing between 3.12 and 3.16 before being added to Oshabi.\\n3.19: Verified Murgeth Bogsong, likely coding to nature_boss\\nDivcord: kroIya verified Elida Blisterclaw in Bramble Valley 3.19\\nProhibited Library: CardPender 3.20 dropped 1 Bitter Blossom from Oshabi over n=200 kills.\\nVerified Gorulis, Will-Thief in 3.21, completing nature_boss - this was likely the original location. oshabi_boss is redundant with nature_boss.\"",
  "\"City Square, Lookout verified in Divcord\\nDefiled Cathedral in divcord\\nSilo verified in divcord\"",
  "\"Labyrinth Darkshrines\"",
  "\"Many claims of Burial Chambers; possibly `alira_area`?\\nOne unverified claim of Spider Forest on reddit; consistent with `alira_area`\\n\\nMay also be related to Map Bosses with Wand Attacks; see Divcord\\n\\nDivcord: Spider Forest verified by RiPHeartofGold 3.19\"",
  "\"3.21: The Brawny Battle Mage can now be found in the The Putrid Cloister, Sepulchre, Waste Pool, and Phantasmagoria Maps.\\nThese Areas all received the new doedre_map_area Tag. They are the only four Areas with that Tag.\"",
  "\"Vault verified in divcord\"",
  "\"screeching_boss seems to be a good match -- is this a Boss-specific drop?\\nMerveil, the Returned => Underground Sea\\nShrieker Eihal => Excavation\\nNassar, Lion of the Seas => Reef\\nThe Sanguine Siren => Crimson Temple\\nErebix, Light's Bane => Cemetery\\nDoedre the Defiler => Sepulchre\\nDivcord: fal verified Nassar\\nClarified that these cards are boss-specific.\\nMineral Pools is no longer eligible due to the boss being changed from Merveil to Shock and Horror\"",
  "\"New beyond verified by Jas\"",
  "\"Needs verification that it cannot possibly drop from any other Incursion Architects\\nXopec (lightning) in divcord incorrect assumption about upgrade rooms/killing architects\"",
  "\"Probably has a Drop Level Cap, which might explain its absence in later Areas\\nRe-investigation in 3.21 indicates that military_area is the closest fit (and not urban_sarn_area). Removed The City of Sarn from legacy locations. Also removed maps - does not appear to drop in maps.\"",
  "\"Cartographer's Strongboxes\"",
  "\"Vaal Side Areas -- but what Area Tag, if any?\\nDrop level of 72\\nNeed to confirm if area drop, boss card, or Vaal Vessel card\"",
  "\"vaal_pyramid_area ?\\nPossible also `vaal_ruin_area` or `ruined_vaal_city_area\\nNeeds verification\\nVaal Pyramid Map verified in divcord\\nDoryani's machinarium verified in divcord\"",
  "\"Needs verification in:\\nAncient City, if `vaal_ruin_area` or `ruined_vaal_city_area`\\nor\\nSunken City, if `ruined_vaal_city_area`\\n\\nAncient City verified in divcord\\nDoes not appear to drop in Sunken City (sample size 20 alch&go and 42 high investment maps)\\nVaal Ruins is not eligible due to area level 20 vs req lvl 23 for card (unless u do some weird strongbox shenanigans)\"",
  "\"Needs tons of verifications before ocean_area can be a reasonable guess\\n\\nUnfortunately The Catch is significantly rarer than The Doctor; hard to observe\\n\\nDivcord: Shore verified\\nDivcord: Peninsula verified by RiPHeartofGold 3.19\\nDivcord: 3.20, Coves verified by Zimzams\\nDivcord: 3.21, Maelstrom of Chaos verified by Elinvynia\"",
  "\"Divcord: The Coward's Trial verified by nennas\\n\\nBased on the pattern of other `crypt_area` Cards, would The Celestial Justicar also drop from Necropolis...?\\n\\nDivcord: 3.21, Elinvynia gathered 117 natural Card drops in Necropolis, 0 hits of The Celestial Justicar\"",
  "\"In the past, there were claims of The Celestial Stone dropping in Lair of the Hydra -- either as an Area drop or as a Boss-specific drop from Guardian of the Hydra.\\nShaper Guardian Maps seem to work like Unique Maps in that they can have Area-specific natural Card drops which do not depend on Tags.\\nThese claims were prior to to the modern Card drop location reworks, however. We don't know if they're still true.\\n* If the Hydra claim were about an Area drop, I'd assume it to be another example of a drop from a Jeweller's Strongbox that someone mistakenly misattributed as an Area drop.\\n* If the claim were instead about a Boss-specific drop, I don't know what to expect re: data for that. If it's eligible, it's likely very uncommon.\\n\\nHere's a \\\"Hydra\\\" claim from 2019 relayed by sirgog (https://www.reddit.com/r/pathofexile/comments/cuynv7/check_out_one_of_the_new_divination_cards_from/ey1knly/); but 2019 is far before the modern Card location rework, so even if it was true in the past it might not be true anymore.\\n\\n(Wiki also has old claims of Basilica, Terrace from 2018. Terrace was tested in Divcord during ~Aug 2022, n=1941 natural Card drops with no hits of The Celestial Stone -- but given the rarity of the Card, that test was technically inconclusive. So far, no affirmative modern evidence exists of drops in those Areas.)\\n3.21: Total cards 2146.\\n\\nDeterministic drop from Jeweller's Strongboxes\"",
  "\"note: Lava Chamber is fire_prison_area, not prison_area. Likewise with Forge of the Phoenix\\nPen verified in divcord\"",
  "\"(Previously Perandus Locker - removed from game)\"",
  "\"Breach Clasped Hand\"",
  "\"`rain_area` alone is not sufficient; The Coming Storm cannot drop in Courtyard (n>1000). See below.\\n\\nVerified Promenade in Divcord\\nReconfirmed Colonnade, Wharf, Villa in Divcord - Jas\\nconfirmed Cemetery in Divcord - fal\\nStagnation confirmed by zimzams\\nCourtyard and Tower do not appear to drop this card\\n\\nExplanation of Tags: The Coming Storm seems to drop in an Area only if (1) the Area has `rain_area`; and (2) the Area does NOT have `lightning_area`. (Fits the theme: The storm is coming, but it has not yet arrived.)\\n\\nVerified Promenade in Divcord\\nReconfirmed Colonnade, Wharf, Villa, Infested Valley in Divcord \\nConfirmed Cemetery in Divcord - fal\\nStagnation confirmed by zimzams\\n\\nExcludes Couryard, Tower, The Vinktar Square\"",
  "\"3.21: previously dominus_monster_map, boss only. Unlikely that Excellis Aurafix will get this tag, so the map now corresponds with sceptre_of_god_area + boss only (assuming it drops from Excellis Aurafix).\\n\\nUpdate: In fact, Excellis Aurafix did receive the `dominus_monster_map` Tag in 3.21! Since the 3.21 patch notes stated \\\"The Conduit can now be found in the Residence Map.\\\", and since Excellis Aurafix's Tags were changed in the same patch, that very strongly implies that `dominus_monster_map` is the correct governing Tag.\"",
  "\"Could this drop from more Bosses than just Xixic? Maybe necromancer_boss ?\\n\\nIf Bone Crypt were to rotate off-Atlas, it'd need a new location.\\n\\nGigaro in Divcord reports a drop from Acton's Nightmare's Boss, which also has `necromancer_boss`\\n\\nDivcord: Infector of Dreams verified by Zimzams\\nDivcord: verified The Bone Sculptor\"",
  "\"Caer Blaidd, Wolfpack's Den only\"",
  "\"Verified in Vaal Pyramid and Vaal Temple in Divcord\\nNeed to verify Maze and Doryani's Machinarium for second Tag\\n\\n3.20: Maze verified by developershins\"",
  "\"Divcord: 3.21, Sunken City verified by Elinvynia.\\nThis supports `ruined_vaal_city_area`.\"",
  "\"(History: There are at least two independent rules for The Damned. The original hypotheses were: (1) `vaal_pyramid_area` => The Damned; and (2) `vaal_ruin_area` => The Damned. But the latter hypothesis was solely due to confirmed drops in Ancient City and vaal_ruin_area was not the only possible Tag option.\\nThe second rule could easily be `ruined_vaal_city_area` instead, which exists only on Ancient City and Sunken City.)\"",
  "\"Divcord: Villa verified by nennas\\nPalace declared in 3.16 patch notes; reverified in 3.20\\nPreviously there was an association to `sceptre_of_god_area`.\\nThe claim on the wiki that The Dapper Prodigy drops in Residence was first made on Dec 2015, i.e., way too old to take seriously.\\nDivcord: 3.20, samples referenced by GAO & more testing showed The Dapper Prodigy is no longer eligible in Residence (p>>0.99)\\n\\n{Villa, Palace} are the sole two Map Areas with `dominus_area`.\\n{Villa, Palace, Residence} are the sole three Map Areas with `sceptre_of_god_area`. If the stale Residence claim from 2015 were taken for granted and it's in fact false now, that would cause an incorrect and misleading Tag association.\\n\\n3.21: previously dominus_area. Assuming that Residence does not gain dominus_area, it would mean that card now drops from sceptre_of_god_area, a previously disproven tag.\"",
  "\"Whakawairua Tuahu\"",
  "\"Racecourse verified in Divcord\"",
  "\"Previously DONE in 3.18\\n\"",
  "\"3.19: \\\"The Deep Ones can now be found in the Strand Map and the Whakawhairua Tuahu Unique Map.\\\"\\nStrand and Whaka both gained the \\\"ship_graveyard_area\\\" tag, but not \\\"reef_area\\\". Is Coral Ruins still correct? Or is ship_graveyard_area a subset of reef_area (therefore automatically corresponding to this card as well?)\\nAlternatively, could be reef_area OR ship_graveyard_area.\\n3.21: Disproved Coral Ruins with 99% confidence.\"",
  "\"We recently got video evidence of The Demon dropping from Kitava, the Destroyer in Lava Lake Map.\\nBut Lava Lake Map was not on-Atlas in 3.17 Archnemesis.\\nSo following GGG's rule, it must have had a secondary drop location -- presumably via `kitava_map_boss`, which applies to \\\"The Destroyer's Heart\\\" (the heart of Kitava, the Destroyer in Lava Lake) and \\\"Lord of the Grey\\\" in Belfry.\\n\\nSo presumably The Demon should also drop from Lord of the Grey, as some people had speculated in the past.\"",
  "\"Divcord: Dark Forest + Forbidden Woods verified by Zimzams\\nBramble Valley  observed by SlipperyJim as kirac mission\"",
  "\"Beach verified in Divcord\\nShore verified in Divcord\\n3.21: Fungal Hollow verified by Pan (Kirac div card mission)\"",
  "\"drop disabled\"",
  "\"3.21: The Doctor can now be found in the The Putrid Cloister, Sepulchre, Waste Pool, and Phantasmagoria Maps.\\nThese Areas all received the new doedre_map_area Tag. They are the only four Areas with that Tag.\"",
  "\"Whakawairua Tuahu Area-specific Drop?\\n3.21: This does in fact still drop from the Crossroads (Act 7). Damn.\"",
  "\"Shares no tags with Whakawairua Tuahu except area_with_water, which is a non-factor.\\nNo lore tidbits. No unique boss. No monsters using Blink or Mirror Arrow. A reference to the moon in Act 2, but not Act 7.\\nPossible reference to Chamber of Sins vs Fellshrine Cathedral? I am stumped.\\nDoesn't appear to drop in Castle Ruins or Fields, and hasn't been reported elsewhere.\"",
  "\"dark_forest_area ?\\nIf so, Bramble Valley and Forbidden Woods need verification\\nForbidden Woods observed by SlipperyJim8 as Kirac Card Mission\\nDivcord: Bramble Valley verified by Cal\"",
  "\"The following note on The Dreamland came from a 2018 claim on the wiki that The Dreamland was a natural Area drop in Laboratory Map. That was prior to the Tag reworks, though: \\\"Could this be an Area-specific drop in Laboratory...? Laboratory is weird in general. Card flavourwise could relate to the boss or Shaper.\\\"\\n\\nLooking at a thread from 4 years ago, seems to be mostly attributed to Cartographer Strongboxes (including Unique ones).\\n\\nUntil we see any evidence of a new Area drop location, assume that The Dreamland is restricted solely to Cartographer's Strongboxes for now.\"",
  "\"Divcord verified drops from legacy-series Academy Maps on Standard\\nRamparts verified in divcord\\nResidence verified in divcord\\nPier + Crystal Ore verified in divcord\"",
  "\"Divcord: Dungeon and Pen verified by Zimzams\"",
  "\"Orchard observed by SlipperyJim8 as a Kirac Mission drop\\nDivcord: Terrace verified by ChronoExile\"",
  "\"Divcord: 3.20, Zimzams documented a drop of The Emptiness from an explodey Mysterious Barrel in Maelstrom of Chaos\\n* Mysterious Barrels behave strangely, but the likelihood that a random Card would be The Emptiness is exceedingly slim.\\n* The drop may be unrelated to explodey Mysterious Barrels completely; those barrels do drop some natural DropPool items. It could simply be a natural Area drop in Maelstrom of Chaos. Its weight is so low that it's possible it simply hasn't been observed before.\\n\\nIf this were somehow a misleading generic drop, assuming solely natural weights, the probability of a coincidence is ~0.0000364.\\n(And Zimzams did not observed any other unexpected Cards from explodey Mysterious Barrels, so the real chance is even less.)\\n\\nDivcord: 3.20, Jasmine found a drop in Maelstrom of Chaos from a non-Barrel source, though the Map did have explodey Mysterious Barrels. The Barrels themselves (or monsters within it) did not appear to drop any unusual cards, debunking the theory of random div cards other than possible reward conversion.\\nSeems like it's simply a natural Area drop in Maelstrom of Chaos. (The Card art looks like a maelstrom.)\\n\\nTo confirm, a positive result will be required from one of:\\na) Maelstrom of Chaos, without Barrel sextant\\nb) Any non-Maelstrom map, with (explody) Barrel sextant\"",
  "\"3.20 patch notes: Added Grotto\"",
  "\"Belfry cited in the Wiki Server\\nDivcord: 3.21, The Twilight Temple verified by Zimzams, Moon Temple by Elinvynia\\n3.22: confirmed Basilica.\"",
  "\"Museum is the only known area - library_area, relic_area, maligaro_area, unholy_trio_area?\\n\\nDivcord: 3.20 Academy verified\\n`library_area` is sole shared Tag\\n\\nVerified Scriptorium in 3.20 standard\"",
  "\"Chayula, Uul-Netol confirmed\"",
  "\"Only a single area is eligible. Will likely get additional tags/eligibility if Thicket is removed from Atlas.\"",
  "\"Wiki claims: Marshes, Sulphur Vents, Forge of the Phoenix\\nIs Marshes still true? (Update: No, Marshes is no longer eligible.)\\nDivcord: Sulphur vents verified\\n\\nShaper Guardian Maps seem to work like Unique Maps in that they have Area-specific natural Card drops which do not depend on Tags. Maybe toxic_pool_area + fire_affinity? Does not explain The Boiling Lake, however.\\n\\nDivcord: Zimzams tested Bog and Marshes in 3.19, disproved The Eye of the Dragon with >99.9% confidence. This means `fetid_area`, `toxic_pool_area` alone are insufficient.\\n\\nI wonder if it has to do with the Basilisk-type Boss, given the observation of it dropping in Story The Boiling Lake?\\n\\nPerhaps a rule like: \\\"Natural Area drop in an Area with a Basilisk-type Map Boss\\\", or perhaps a reference to at least two of the Map Boss's Tags like `fire_affinity`+`reptile_beast`?\\n\\nOr perhaps even another name/internal reference check like that of The Spoiled Prince? I noticed that the internal name of the Sulphur Vents Map Boss (The Gorgon) is `IguanaBossPhoenixMap` which strangely includes the word \\\"Phoenix\\\", and The Eye of the Dragon was also found in Forge of the Phoenix (which we thought was possibly just a hardcoded exception like some other Shaper Guardian Area Cards).\\nThe only relevant Monsters with internal name like /phoenix/ are Guardian of the Phoenix, The Basilisk, and The Gorgon -- so there currently are not any others to test.\"",
  "\"Divcord verified Mineral Pools\"",
  "\"Not obtainable in The Sewers due to drop level.\"",
  "\"Shrine was legacy drop location; may have been reintroduced - correction, this card was never removed and should still drop in Shrine.\\n\\n3.20: Kory reports a The Fiend in an Atlas Memory in Foundry\\n\\nPreviously this was guessed as `lunaris_blood_area` due to the only historical reports being Shrine and Poorjoy's Asylum.\\nBut Shrine and Poorjoy's Asylum also have `thaumaturgy_area`, like Foundry does.\\n\\nCrusader posted a verfiable drop from Laboratory from Archnemesis league during the 3.21 era.\"",
  "\"<')))><\"",
  "\"Needs many Boss verifications before being seriously considered\\n\\nDivcord: Stonebeak verified by nennas\\n\\nDropped from one of unique mobs (Rogue Exile, not sure) in A5 Dried Lake\\n\\nEyepecker, Animal Pack verified in divcord\\nLord of the Ashen Arrow verified by Jas\\nDivcord: Mirage of Bones verified by kroIya 3.19\\n\\nDivcord: (Story) Dried Lake Nightwane verified by Terrorsatan 3.19\\n\\nCannot find evidence of Lieutenant of the Bow\"",
  "\"**Has Drop Level Cap.** Cannot drop in T16 Maps, even if eligible per Tags.\\nVerifications need to be done in lower-Tier Maps.\\n\\nforest_map_area is an OK candidate, but needs more verified locations first\\n\\nDivcord: T1 Stagnation verified. (But cannot drop in T16 Stagnation.)\\nT6 Bramble Valley verified\\nT1 Thicket verified, does not drop in T11 Thicket\\nT7 Dark forest verified (does not drop T16 dark forest)\\nT6 Lair verified\\nT3 Ramparts, T3 Forbidden Woods verified. Does not drop in T10 Forbidden Woods.\"",
  "\"Temple only? May be related to Jorus, Sky's Edge specifically\"",
  "\"Coves was legacy drop location; may have been reintroduced\\nCoves verified in divcord\\nMight also be `reef_area`; Coral Ruins would need verification\\n3.19: \\\"The Formless Sea can now be found in the Strand Map and the Whakawhairua Tuahu Unique Map.\\\"\\nNeeds check if these maps have reef_map or ship_graveyard_area tag. If not, may be manual\\nVerified that Strand/Whaka gaine ship_graveyard_area\"",
  "\"Zimzams on Divcord verified The Forsaken from a Kirac Card Mission in Cursed Crypt.\\n\\nMaybe it's affected by two or more Tags? `crypt_area` would cover Bone Crypt, Cursed Crypt, and Coward's Trial. But this doesn't cover all the wiki claims.\\n\\nPerhaps some of the claims on the wiki are also outdated...?\\n\\nDivcord, Necropolis verified still true in 3.18\\nDivcord, The Coward's Trial verified by nennas as still true in 3.18\\n\\n\\nIs Olmec's Sanctum still an eligible drop location in 3.18?\\nIf so, it's probably a Unique-Map-specific eligiblity without a Tag for that Area. We've seen that a couple of other times, e.g. apparently in Poorjoy's with other Cards.\"",
  "\"As with other cases, Necropolis's `necropolis_area` Tag seems to be treated as `crypt_area` even though Necropolis is missing the `crypt_area` Tag\"",
  "\"Divcord: Doryani's Machinarium verified by Jasmine\\n\\nDivcord: Tower Map screenshot posted by Chuff with \\\"no Sentinels used\\\" was at Area Level 76, which means Eldritch Altars were very unlikely to be involved (outside of a quest proc -- but even then the visual effects of floating embers/goo are not present which probably implies no quest proc...?)\\n\\nUpdate: Based on further testing in Tower, it seems like The Forward Gaze is most likely not a natural drop in Tower after all. The only verified drop location is Doryani's Machinarium.\"",
  "\"The Fox is a verified drop in Fields Map; see Fields Map sample in Divcord (46 The Fox obtained)\"",
  "\"Divcord: Orchard verified by nennas\\nDivcord: Terrace verified by nennas\"",
  "\"Gemcutter's Strongbox\"",
  "\"Divcord: KroIya disproved The Golden Era in Villa, >99.99% confidence in sample, 3.19\\nThis proves that `wealthy_area` alone is insufficent\\nDivcord: 3.20, Zimzams tested Temple with n=158, 0 hits of The Golden Era\\nDivcord: 3.20, Zimzams reverified Ivory Temple\\n\\nDivcord: 3.20, Jasmine analyzed Tags for `wealthy_area` Areas. Outside of Residence which was added later in 3.19 and has separate governance, Jas's statement of \\\"eligible in an Area with `wealthy_area` whose Boss has `has_two_handed_melee`\\\" accurately describes the Areas in which The Golden Era can occur.\\nWe checked the Bosses of all other `wealthy_area` Areas and found no counterexamples.\\nThere's no way to disprove that hypothesis with current Maps' Tags, and the hypothesis accurately predicts the non-patch-noted Areas in which The Golden Era occurs, so this seems sufficient for now.\\nMaybe in the future a new Map in which The Golden Era is eligible will reveal more info.\"",
  "\"Cannot distinguish between {wealthy_area + tower_area} and {wealthy_area + undying_boss_area} -- both sets return only Residence, so either set could be the governing rule\\n\\n3.19 \\\"The Golden Era can now be found in the Residence Map.\\\" - may have introduced a new tag options. Need to rule out other maps - Only Villa and Crimson Township will be on atlas in 3.19\\n\\nDisproved in Chateau with 367 natural card drops; not city_home_area.\\nDisproved Villa with 303 natural card drops; not sceptre_of_god_area.\\nDivcord: 3.20, Zimzams tested Temple with n=158, 0 hits of The Golden Era\\n\\ntower_area may be more likely considering that The Tower is referencing a staff\"",
  "\"Shaper?\\n\\nDivcord 3.22: Kenny obtains The Greatest Intentions from The Feared.\\nUnknown if this is specific to The Feared, or from one of the Bosses.\"",
  "\"\\\"elder_boss\\\": Regular Elder is not eligible (drops i85 in the regular fight; card requires i86). Unknown if it can drop from The Feared's Elder if the invitation's level is raised due to removal of Atlas Keystone.\"",
  "\"Divcord: Fields verified\\nPrevious guess was `fields_area` but...\\nTechnically could also be `crossroad_area` ; need more verifications to determine (Castle Ruins specifically)\\n\\nDroprate is quite low, about that of The Nurse\\n\\nDivcord: Zimzams tested n~1200 in Peninsula, no The Harvester; ~99% confidence. Either sample was unlucky or `crossroad_area` is the real governing Tag.\\n\\nDivcord: Castle Ruins verified by RiPHeartofGold 3.19\"",
  "\"Story only - Act 7?\\nMight have Drop Level Cap? not necessary if using tileset\\nDivcord verified The Northern Forest (Act 7)\\n3.21: Verified in Maligaro's Sanctum, meaning tileset is not the correct hypothesis.\\nMay still be worthwhile to check some areas in Act 6 linked to the Forest areas.\"",
  "\"Arcanist's Strongbox\"",
  "\"Divcord: Maze verified by RiPHeartofGold 3.19\"",
  "\"Mineral Pools verified in Divcord\"",
  "\"Core was legacy drop location; may have been reintroduced\\n\\nDivcord: Core verified 3.18\"",
  "\"Drops from the grandmaster created by Dy'Ness specifically; current name in data is `QBotU_DyNess`\\nNo longer monster-specific.\"",
  "\"3.21: The Incantation can now be found in the The Putrid Cloister, Sepulchre, Waste Pool, and Phantasmagoria Maps.\\nThese Areas all received the new doedre_map_area Tag. They are the only four Areas with that Tag.\"",
  "\"No tags on maps\\n\\nOne possible explanation:\\nNot a Boss-specific drop, but keyed off of a Boss's Monster Tag? \\\"Drops in any Areas where Boss has innocence_map\\\"?\\n\\nThere are a couple of other candidates that follow that potential pattern, where there is not an appropriate Area Tag, but the Card is nevertheless predictable based on qualities of the Boss.\\n\\n3.19: The Innocent can now be found in the Defiled Cathedral Map. Chamber of Innocence tileset? AvariusCasticus instead of innocence_map? Woad, Mockery of Man could also gain innocence_map tag instead \"",
  "\"No tags on maps\"",
  "\"Divcord: Mud Geyser & Bog verified by fal\\nDivcord: Stagnation\\nDivcord: Marshes verified by nennas\\nSulphur Vents verified in divcord\"",
  "\"Divcord: Core verified by ColdMamba\\n\\nPreviously we'd wondered if `belly_area` might fit too, since the confirmed locations of Core and Carcass had both `harvest_area` and `belly_area` and we weren't able to distinguish between them. If true, then The Insatiable would also have been able to drop in {Malformation, Phantasmagoria} which have `belly_area` but not `harvest_area`\\nDivcord: 3.20, Zimzams showed 0 hits of The Insatiable in Phantasmagoria, n=69, meaning `belly_area` is not sufficient to make The Insatiable eligible. Only `harvest_area` enables it for now.\"",
  "\"Other vaal Tags might also qualify\\nDoryani's Machinarium verified on Divcord\"",
  "\"Formerly dropped from Villa\"",
  "\"No longer drops from The Crystal Veins.\\nPrim blocks verified in divcord\\n3.19: \\\"The Jeweller's Boon can now be found in the Grotto Map.\\\"\"",
  "\"fal claimed Alleyways on Divcord, confirmed by Jas\"",
  "\"Forking River has map_area_with_open_water but not ocean_area, could be used as a test\\nBeach and Port have ocean_area but not map_area_with_open_water, could be used as a test\\nDivcord verified drop in Mao Kun, Wharf, Reef\\nDivcord verified drop in Whakawairua Tuahu\\nDivcord verified in Port, which means ocean_area is correct (unless both Tags work, in which case ocean_area is still correct, just one of two)\\nDivcord verified in Shore\\nDivcord verified Tropical Island\\nDivcord verified Strand\\nDivcord verified Pier + Estuary\\n3.19: verified Plateau\\n3.20: verified Coves\\n3.20: verified The Journey in Maelstrom of Chaos while collecting data to estimate The Leviathan\\n3.20: verified Coral Ruins\\n3.21 verified Beach\"",
  "\"Wiki claims Pit; need more drop locations to verify.\\nTry to find a drop in a Map with one or more related Tags.\\nTry: daresso_area, pitfight_area\\n\\nDivcord: Pit verified by Zimzams\\nDivcord: Arena verified by Zimzams\\nDivcord: Chimera + Colossuem verified by Zimzams\\n\\n\\nDue to Drop Level Requirement, we cannot use The Grand Arena to distinguish between `daresso_area` and `pitfight_area`. For now just assume it's `daresso_area` due to flavour-- inconsequential currently since all eligible Maps have both Tags.\"",
  "\"Whakawairua Tuahu drop in divcord\"",
  "\"Wiki claims Pit of the Chimera and a Boss-specific drop from Ambrius, Legion Slayer\\n\\nDivcord: Pit natural drop verified by Zimzams, so it has at least some non-Boss-specific drop conditions, probably `pitfight_area`\\nDivcord: Arena verified by Zimzams\\nDivcord: Colosseum verified by RiPHeartofGold\\n\\nCould also be `daresso_area`; all Map Areas with `pitfight_area` also have `daresso_area`.\"",
  "\"Poorjoys\"",
  "\"necromancer_boss ?\\nIf so, more Bosses need to be verified\\n\\nfal posted in Divcord a full stack Kirac Card Mission drop from non-Boss in Necropolis\\nDivcord: 3.21, Elinvynia reports: \\\"I ran 105 Acton Nightmares (no MF boss rushing, mostly very low tier) trying to verify The Lich - I didn't get it\\\"\\nHistorically dropped from Merciless Sawbones. All necromancer-type bosses do not appear to drop this card anymore - different tag?\"",
  "\"necromancer_boss no longer appears to be the associated tag.\"",
  "\"Silo verified in divcord\\nDefiled Cathedral verified in Divcord\\nHaunted Mansion verified by Jasmine\"",
  "\"Enriched Eternal Labyrinth - Izaro's Treasure chests\\n\\nDivcord: 3.20, regular (non-enriched) Uber Lab verified by sokratis12GR\\nReverified in regular Uber Lab again in 3.21\\nInterestingly, the Uber Lab chests appear to ignore the level 80 drop level requirement.\"",
  "\"May be joined bridge_area with snow_area/rain_area, which would exclude Primordial Blocks this theory disproved by newer maps\\n\\nDivcord: verified Mineral Pools, Alleyways, Siege, Castle Ruins, Armoury\\nDivcord: verified Arachnid Tomb\\nDivcord: Forking River verified by RiPHeartofGold\"",
  "\"Ivory Temple observed by SlipperyJim8 as a Kirac Card Mission drop\\n\\nDivcord: Crimson Township verified by fal as a Kirac Card Mission drop\\nDivcord: Laboratory verified by Jasmine as a Kirac Card Mission drop\\nDivcord: Basilica verified by nennas\\nDivcord: Palace verified by nennas\\nDivcord: Conservatory verified\\nDivcord: Haunted Mansion verified\\n\\nWiki claims Siege but that note was added pre-3.17; no longer true?\\n\\n3.19 Divcord: Vault, Villa, Chateau, Temple\\n\\n3.21: Relic Chambers verified by RiPHeartofGold\\n3.21: Siege no longer appears to drop this card.\\n\\nDivcord 3.21: The Twilight Temple verified by Zimzams\\nVaults of Atziri verified by Elinvynia\"",
  "\"The Lover cannot drop from Mineral Pools, the wiki note there must be out-of-date. (Sampling expected: 94; observed: 0)\\nThe Lover also cannot drop from Whakawairua Tuahu. (Sampling expected: 42; observed: 0)\\n\\nThis means that The Lover is governed by `merveil_area`, not `sea_witch_boss_area`.\"",
  "\"Need to test if Shrine still drops this\\nDivcord: Zimzams ran Shrine, n=31, zero The Lunaris Priestess drops\"",
  "\"Monster Tag probably fits, but this could also be e.g. \\\"Map Bosses killed in `king_boss_area` Areas\\\"\\n3.20: The Mad King Divination card has been re-enabled, and now awards an Ultimatum Aspect. This card can now be found in the Caldera, Colosseum, Dark Forest, and Reef Maps\\nJasmine confirmed drops as an area drop. This most likely rules out Aul (The Crystal King's Throne) and Talisman Rigwald (Lair of the Wolven King). Drop level was changed to 68 (from 27), making it ineligible for Kaom's Dream, Daresso's Dream, and the Brine King's Reef.\"",
  "\"Lair, Pen (Lair added in 3.16 after Pen was off-atlas; may be area specific?)\\nBoth Lycius, Midnight's Howl and Arwyn, the Houndmaster are \\\"masters of canines\\\" and can spawn wolves/hounds respectively.\\nRuled out Dark Forest with 99.9% certainty\"",
  "\"drop disabled\"",
  "\"Divcord verified Strand in 3.18 again\"",
  "\"no clear connection\\nCrystal Ore boss is named \\\"Messenger of the Hollows\\\"\\nVerified in crystal ore\\n\\nI wonder if any other dock_area Areas might comply with The Messenger other than Port (Wharf, Shipyard, Pier).\\n\\nSince Crystal Ore Boss is \\\"Messenger of the Hollows\\\", it might be both a Tag plus a special circumstance like our hypothesis for The Spoiled Prince:\\nThe Spoiled Prince => \\\"Natural drop in an Area whose Boss is a Prince\\\"\\nThe Messenger => \\\"Natural drop in an Area whose Boss is a Messenger\\\"(?)\\n\\nDivcord: 3.20, disproved in Shipyard (n=370, conf>>0.99). So `dock_area` alone is not sufficient.\\n\\nPerhaps \\\"Unravelling Horror\\\" may be a reference to the scroll unravelling?\"",
  "\"No longer drops in coast/mud flats Act 1 due to ilvl 23 requirement\"",
  "\"Stalker of the Endless Dunes verified on divcord - possibly suspect mine_area + boss only?\\nChronoExile reported Lord of the Hollows\\nVerified to still drop from Xixic as of 3.19. Reports in 3.17 of it being an area card - may have changed to be boss only - current theory\\n\\n3.19: Breaker Toruul in Excavation verified in Divcord\\nConsistent with hypothesis: 'Kill a Map Boss in a `mine_area` Area'\\n\\n3.20 patch notes: Added Grotto - verified Void Anomaly\\n\\nVerified Avatar of Undoing and Shrieker Eihal in 3.21\\nXixic, High Necromancer is the only outlier\"",
  "\"Divcord: Glacier verified and reverified in 3.21 (off-atlas)\\n3.20 patch notes: Added Volcano - did not get snow_mountain_area, outlier?\"",
  "\"No evidence of Arachnid Tomb drops that we can find -- and a few people have tried spamming Arachnid Tomb with no drops. Original wiki claim of Arachnid Tomb came from a user in Mar 2019. Seems like an error, and The Nurse probably does not in fact drop from Arachnid Tomb.\\n\\nIf someone verified Scriptorium, this would probably be enough to conclude `shavronne_area`.\\n3.20 patch notes: The Nurse can now be found in the Carcass Map.\\nIt seems like Carcass's Boss (Amalgam of Nightmares) exclusive Tag `unholy_trio_combined_boss_map` might qualify for `shavronne_area`; see below.\\n\\nDivcord 3.21: Scriptorium verified by Itacheey\\nDivcord: 3.21, A9 The Rotting Core verified by Maude034, shared by CardboardMonka\"",
  "\"3.20 patch notes: The Nurse can now be found in the Carcass Map.\\nThis is a natural Area drop (not Boss-specific), verified by Jasmine\\n\\nIt seems like Carcass's Boss (Amalgam of Nightmares) exclusive Tag `unholy_trio_combined_boss_map` might qualify for `shavronne_area`.\\n\\nWith confirmation of The Nurse in The Rotting Core, this completes 4/4 eligibility in \\\"harvest_area\\\" (2 were already confirmed and Carcass was patch noted).\"",
  "\"Which specific Abyss Monsters? Any? \\n`abyss_commander_monster` ?\\n`abyssal` ?\"",
  "\"Possible parallel to The Depraved Trinity due to it being eligible from Amalgam of Nightmares?\"",
  "\"3.20 patch notes: Added Carcass\"",
  "\"Original drop locations; consistent with theme of card.\"",
  "\"3.18 patch notes say:\\nSome Divination Cards have found new homes as a result of these Atlas Changes:\\nThe Offspring can now drop in the Peninsula Map.\\n\\nRyslatha and Gorulis have `nature_boss`, a possible Monster Tag candidate.\\nVerified Murgeth Bogsong (Stagnation); appears to be boss only\\nAlso not dropping from Peninsula cards (1194 card sample, 6 maps) - likely to be boss only\"",
  "\"People in the Fishing Research Discord have claimed The Old Man drops in the following locations, not yet reflected on the wiki other than Strand:\\n{Atoll, Lighthouse, Peninsula, Pier, Shore, Strand, Tropical Island, Wharf}\\n\\nThis leaves the following Areas to verify:\\n{Whakawairua Tuahu, Maelström of Chaos, Coral Ruins, Mao Kun, Untainted Paradise, Plateau, Estuary, Shipyard, Coves, Reef, Forking River}\\n\\nNote that all claimed drop locations also have ocean_area, not just map_area_with_open_water.\\nForking River is the litmus test:\\nForking River has map_area_with_open_water, but NOT ocean_area.\\nSo if The Old Man drops in Forking River, then ocean_area is not correct.\\n\\nDivcord 3.22: KroIya reverified Tropical Island\"",
  "\"coast_boat_map most likely, meaning Shore is the other candiate?\"",
  "\"Divcord: Grave Trough verified by nennas\"",
  "\"Divcord: Twilight Temple verified\"",
  "\"Divcord: Dark Forest + ramparts verified by Zimzams\\nDivcord: Bramble Valley + Forbidden Woods verified\"",
  "\"Divcord verified in Wharf\\n\\nDivcord: 3.20, verified in Shipyard\"",
  "\"Level 68+\\n\\nLighthouse claim on the wiki was added 2021/02/07 by the wiki user TheTreeBranch -- but no documentation of the drop? Maybe an error, e.g. mistaking a generic Card source for a natural Area drop...? There is a very slim chance it may be still eligible.\\nThis was in 3.13 Ritual, far before the sweeping changes occurred in 3.17 and 3.18.\"",
  "\"Cage verified in Divcord\\nDungeon verified in divcord\\nPen verified in divcord\"",
  "\"Port verified in Divcord\"",
  "\"Incomplete hypothesis. See below\"",
  "\"Related to Porcupine Goliath spawn areas, but Porcupines do not necessarily need to be in the map (desecrate pool?)\\n\\nDivcord: Plaza verified by nennas, which does not have `garden_area`, further supporting association with Porcupine Goliath instead of just Area Tags\\nDivcord: Terrace verified by nennas\\n\\nJasmine's old comments are still true re: The Porcupine being associated with natural Porcupine Goliaths spawns instead of just a single Area Tag.\\nBecause of nennas's earlier verification in Plaza, we know The Porcupine is not governed solely by `garden_area` or `labyrinth_tileset_area`.\\n\\nAre there any Areas without either Tag that naturally spawn Porcupine Goliaths?\\nOr maybe it's as simple as *both* of those Tags enabling The Porcupine...? If {Chateau, Conservatory} also have The Porcupine as an eligible natural Card, and no other Maps do, maybe that's the answer...?\\n\\nDisproved in Chateau with 367 natural card drops; not simply labyrinth_tileset_area.\\nDivcord: 3.21, Zimzams tested Conservatory; 71 natural Card drops, 0 hits.\\n\\nMonster-specific hypotheses are not common, so looking more at area tags, \\\"garden_area OR (labyrinth_tileset_area & NOT indoors_area)\\\" does fit the bill and includes Plaza on top of the garden_area maps. Plaza has very few tags to work with otherwise\"",
  "\"Additional drop conditions? Seems odd\"",
  "\"Additional drop conditions? Seems odd\"",
  "\"Additional drop conditions? Seems odd\"",
  "\"Additional drop conditions? Seems odd\"",
  "\"also includes Invasion Bosses\"",
  "\"drops only from boss\\nNeed to verify Primordial Pool Nightmare's Omen\\n\\nMatimateo in Divcord claims multiple drops from Primordial Pool Nightmare's Omen\"",
  "\"Divcord confirmed Museum and Laboratory, and also legacy-series Academy on Standard; probably at least `library_area`, but this doesn't explain Laboratory\\nVerified scriptorium in divcord\\n\\nDivcord: Laboratory reverified by CommissarTyr in 3.19\"",
  "\"The Professor also drops from Laboratory -- but what governs this?\\nReported drop from Ciergan, Shadow Alchemist - unclear if altar was used\\nCould also be inventing_area\\nNeed to prove either Shrine or Vault to confirm.\\n\\nDivcord: 3.20, Zimzams tested >500 natural drops in Shrine without producing a single The Professor. This rules out The Professor with >99% confidence from Shrine, which means `thaumaturgy_area` is unlikely to be an eligibility Tag.\\n\\nEither this is a specific exception for Laboratory, or `inventing_area` is another eligible Tag. (Probably the former.)\\n\\n3.21: Elinvynia disproved in Foundry 99.9%. wealthy_area is the only  unshared tag with Laboratory, so it's rather unlikely either inventing_area or thaumaturgy_area are the answer.\"",
  "\"Selenia, the Endless Night\\n\\nDivcord: Goruku found one from Helial, the Day Unending in Twilight Temple in 3.19; perhaps `solaris_boss_map` is eligible too? Or a specific additional exception for Twilight Temple?\\n\\nDivcord: Khor, Sister of Shadows in cold River verified by Goruku 3.19.\\n\\nPerhaps this is handled by a rule like: \\\"Defeat Map Boss of a `lunaris_area` Area\\\"? Maybe that rule could explain why a Lunaris-themed Card is eligible from the Solaris-themed Boss (Helial, the Day Unending in Twilight Temple)?\\n\\nOr the rule could depend on multiple concurrent Tags, e.g. \\\"Defeat Map Boss of an Area with both `lunaris_area` and `solaris_area`\\\". This would narrow eligible drop sources to the Bosses of Twilight Temple and Cold River.\"",
  "\"66% confident to disprove Necropolis; however, based on The Celestial Justicar, it seems highly likely that necropolis_area is not an overlapping tag with crypt_area.\"",
  "\"Divcord: Skullbeak verified by fal\"",
  "\"Breach Monsters, but which? All?\\nbreach_commander ?\\n\\nAlso has been observed as Kirac Card Mission drops in: {Park, Marshes, Bazaar}. See Divcord. Jasmine: The Realm is likely added to the pool of possible cards in Kirac Missions. The card does not appear to drop in a single card - only in stacks. Kirac Missions can also pool boss cards, and is likely governed by unusual rules.\\n\\nAppears to drop from any Breach Monster\\n\\nDvicord: 3.21, Elinvynia counted Active Skill Gems in Breachstones and proved that The Realm is a deterministic drop (not a natural drop).\"",
  "\"Diviner's Strongbox, Izaro's Treasure\"",
  "\"Divcord: Peninsula verified\"",
  "\"Divcord: Dark Forest verified by Zimzams\\nDivcord: Orchard verified by nennas\\n\\nAll of {Shore, Orchard, Dark Forest} were eligible drop locations in the past. Probably these are still eligible now.\\n\\nDivcord: Shore verified by kroIya 3.19\"",
  "\"previously known as The Iron Bard; requires reconfirmation in The Vinktar Square.\"",
  "\"Dig, Summit, Maze of the Minotaur, The Descent, The Foothills\\nNo shared tags except einharmaps and cannot_be_twinned\\n\\nDivcord: Ræin verified A9 The Descent, which shares `snow_mountain_area` and `snow_area` with Summit.\\nDig verified via Kirac Mission (Slipperyjim)\\nGoruku verified The Foothills\\nReverified 3.20 Maze of the Minotaur, no titan mobs\\n\\nCould this card be mob-specific? Goruku proposes it being related to Boulder-type Golems (https://discord.com/channels/834368692560461846/834368692997455924/1028577393239130153)\\nDig: Cinder Elemental\\nMaze of the minoatur: Hulking titan\\nSummit: mountain fragment, frozen titan, cinder elemental\\nThe descent: frozen titan\\nthe foothill: mountain fragment\\n?Summit or crematorium to disprove\\nHowever NOT peninsula. Does not appear to necessarily require the mob type to spawn in the map.\\nCould also be related to Bull/Taurus mobs.\\n\\n3.21: Verified The Ascent (likely a Vendigo?) Still no significant leads in terms of tags.\"",
  "\"Confirm if area drop vs monster-specific card?\"",
  "\"marketplace_area + slums_area ?\"",
  "\"marketplace_area + slums_area ?\"",
  "\"appears to be a map tag, though card only drops from Unique Monsters\\n\\nAnother example of this type of rule:\\n\\\"Kill a Boss in an Area with the `scavenger_boss_area` Area Tag\\\"\\n\\nNo drops of The Scavenger in Underground River (n=100), unexpected if It That Fell was still an eligible drop.\\nThe Hundred Foot Shadow is not eligible due to drop level.\"",
  "\"Divcord: Thicket verified by abax and Crash\\nDivcord: Dark Forest verified by Zimzams\\nStagnation reported from Obob\"",
  "\"3.21: previously dominus_monster_map, boss only. Unlikely that Excellis Aurafix will get this tag, so the map now corresponds with sceptre_of_god_area + boss only (assuming it drops from Excellis Aurafix).\\n\\nUpdate: In fact, Excellis Aurafix did receive the `dominus_monster_map` Tag in 3.21! Since the 3.21 patch notes stated \\\"The Sephirot can now be found in the Residence Map.\\\", and since Excellis Aurafix's Tags were changed in the same patch, that very strongly implies that `dominus_monster_map` is the correct governing Tag.\"",
  "\"Trials of Ascendancy in Maps?\\nVerified a drop in a Vaal side area (Evacuated Quarter) of area level 83. 3.17 Patch Notes stated \\\"It now only drops in Maps at level 80 and above.\\\"; this may be an example of obfuscated patch notes - may be a drop in i80+ Vaal Side Areas (and lab trials?)\"",
  "\"Mineral Pools Divcord verified drop by Xsia\\nInfested Valley Divcord verified drop by Xsia\\nCastle Ruins verified in divcord\\n\\nDivcord: Forking River verified (legacy-series on Standard)\\nDivcord: Arachnid Tomb verified by RiPHeartofGold\\nDivcord: 3.20 Primordial Blocks verified by CardboardMonka\\nDivcord: 3.20 Iceberg verified by Zimzams\\nDivcord: 3.21 Siege verified by RiPHeartofGold\"",
  "\"Reports from 2018 regarding Brine King's Reef and The Cavern of Anger (Act 6). Neither of these fit the theme. Historic drop locations were Mineral Pools (when the boss was still Merveil, the Reflection), Maelstrom of Chaos, and Underground Sea.\\nRemoved the story locations for now.\"",
  "\"Fairgraves, Never Dying\"",
  "\"Divcord: clip of Lighty posted by Zimzams shows drop in Museum\\n\\nDivcord: Core verified\\nDivcord: Phantasmagoria verified by Zimzams 3.19\"",
  "\"Divcord: 3.21 Siege verified by RiPHeartofGold\\nNo further sightings in Maelstrom of Chaos, may be a conversion drop.\"",
  "\"Divcord, Xsia confirmed Vaal Pyramid in 3.18, from a regular Monster (not Boss)\\n\\nI wonder what The Spoiled Prince's Tag governance could be, if any. It's almost certainly not vaal_pyramid_area since the prior sample of Vaal Temple (which also has that Tag) produced 152 The Inventor but 0 The Spoiled Prince.\\n\\nMaybe it has to do with a Map Boss being a Prince? But unlike other Area Tags that describe Boss type presence (e.g. golem_boss_area), there isn't one for \\\"prince\\\"...\"",
  "\"Note: The Fallen Courts and The Haunted Reliquary are no longer accessible areas. They were part of the Epilogue during the Conquerors of the Atlas expansion and became inacessible with Siege of the Atlas.\\n\\nDivcord: Estuary, Silo\\nDivcord: 3.21, A3 The Crematorium verified by Elinvynia\\nThe Ravaged Square verified by Elinvynia\"",
  "\"Divcord: fal verified in Tower\\n\\nDivcord: 3.20, Zimzams tested \\\"21 cards in Vinktar Square ~ 9x Struck by Lightning, 12x Thunderous Skies. No the Stormcaller\\\"\\nDivcord: 3:20, Jasmine tested 26 cards in Vinktar Square ~ 6x Struck by Lightning, 20x Thunderous Skies. No the Stormcaller.\\nUnlikely that tag is only \\\"lightning_area\\\" to prevent recursion of card -> reward -> card\"",
  "\"Divcord: fal verified drop in Spider Forest\\nDivcord: Jas verified drop in Cage\\n\\nDivcord: Zimzams did n=65 sample in Lava Chamber with zero hits; extremely high confidence that The Summoner no longer drops in Lava Chamber\\nElinvynia verified in Chamber of Sins Level 1 (Act 7)\"",
  "\"Divcord: Moderate evidence from Ivory Temple testing that The Sun no longer drops here\\n\\nDivcord: Cold River verified by Zimzams\\nDivcord: 3.21, [Story] A8 The Solaris Temple Lv2 (from Dawn, Harbinger of Solaris) verified by Zimzams\"",
  "\"Drops even in T16 Maps, unlike some of the other Map Reward Cards -- so this one does *not* have a Drop Level Requirement like some other similar Cards.\"",
  "\"Verified Erythrophagia drop in divcord, confirming it also drops from fat Doedre.\\nNeed to test Sepulchre and Core bosses.\\nDrop disabled - on hold.\"",
  "\"Divcord: Pit of the Chimera verified by Jasmine\\n\\nCould be either `daresso_area` or `pitfight_area` -- currently these Tags both match the exact same 4 Maps\\n\\nStory could be used to distinguish: The Grand Arena has `daresso_area`, but not `pitfight_area`.\\n\\n\\nDivcord: Story Daresso's Dream verified by Stymphalian ID.27.\\nDivcord: Pit, Arena verified by Zimzams\\nDivcord: Story The Grand Arena verified bY Stymphalian ID.27, which confirms `daresso_area` instead of `pitfight_area`.\"",
  "\"Divcord: Laboratory verified by ColdMamba\\nDivcord: Replica Poorjoy's Asylum verified by CommissarTyr 3.19\\nFrom poking around in the data, it looks like Replica Poorjoy's Asylum reuses the same WorldArea as Poorjoy's Asylum. Thus it seems safe to verify the non-Replica version.\"",
  "\"Likely a global drop; see Divcord\\nAs of 2022/06/29, at least 8 more locations verified than are documented on the wiki -- we haven't found a single counterexample yet of an Area which *cannot* produce The Tinkerer's Table\\n\\nDivcord Xsia verified Foundry\\nOther Divcord verifications beyond the 8+1 above:\\nInfested Valley, Palace, ..\"",
  "\"Factory, Silo\\n\\nThe only 3.18 verification we have is Factory (it's common there), and Factory's sole non-vacuous Tag is `warehouse_area`, which is why the Tag association here was originally set to that.\\nThe Tireless Extractor does not drop in Arsenal, however, which has `warehouse_area`. Thus that Tag cannot be the governing factor.\\n\\nRe-verified as dropping in Silo in 3.18 using a legacy-series Silo Map on Standard.\\nBut other Maps that have Silo's Tags do not seem to produce The Tireless Extractor.\\n\\nThere's something else special about Factory and Silo which govern the natural Card drop in those Areas. Forge_Area in 3.21 connected the two maps, but the actual relationship could be something else.\\n\\n3.21: Elinvynia found no cards in 56 cards in Foundry or 20 in Phoenix. This makes it more likely it's not related to Forge_Area\"",
  "\"3.21: Reconfirmed The Sarn Ramparts\\nThe Ebony Barracks and The Solaris Concourse are locations from old wiki - Ebony Barracks may be incorrect.\"",
  "\"73+ Global Map\\n\\nHas Drop Level Cap - max ilvl 77\"",
  "\"Divcord: Dunes verified by ColdMamba\\nDry Sea verified in 3.21 by Elinvynia\"",
  "\"Moon temple verified in divcord\\nDivcord: Cold River verified by Zimzams\\nDivcord: Strong evidence from Ivory Temple testing that The Twins no longer drops here\\nDivcord: Twilight Temple verified\\nDivcord: Temple verified by Zimzams\\nTemple has `solaris_area`, not `lunaris_area`\\r\\nNot unexpected given theme of Card\"",
  "\"Formerly dropped in Primordial Blocks Map for 1 league.\\n\\nReddit claims: Port\\nRainover68 on Divcord claims: \\\"either Arcade or Arsenal\\\"\\n\\nPrecinct, Port, Arsenal all have `urban_sarn_area`\\nPrecinct reconfirmed in 3.18 in Divcord by Zimzams\\nArsenal testing showed 0 The Tyrant after 756 natural Card drops. This rules out `urban_sarn_area`.\\n\\n\\n`ruined_area` also fits for Precinct, Port, and Arcade\\n\\nDivcord: Coral Ruins verified by nennas, which has `ruined_area` and not `urban_sarn_area`, so the association is likely the former\\nDivcord: Bazaar verified by nennas\\nDivcord: Castle Ruins verified by Zimzams\\nDivcord: Ancient City verified by RiPHeartofGold 3.19\\nDivcord: Ghetto verified by RiPHeartofGold 3.19\\nDivcord: Arcade verified by RiPHeartofGold 3.19\"",
  "\"Iron believed this dropped in Courthouse in earlier leagues, not from a Boss\\nSlipperyJim8 observed this as a Kirac Card Mission drop in Precinct\\nPossibly rogue_exile_boss_area, which covers exactly {Precinct, Courthouse}\\nDivcord: Whakawairua Tuahu verified\\nConservatory was explicitly included in 3.16; need to re-verify if it is still eligible.\\n\\nDivcord: 3.21, zero hits of The Undaunted in Conservatory (n = 154, c ~ 99% by Elinvynia). This means that the 3.16 patch note is out-of-date (this patch note predated the major Tag reworks), and The Undaunted very likely no longer drops in Conservatory.\"",
  "\"Divcord: Villa verified by ChronoExile\\n\\nThe Unexpected Prize occurred in a 3.18 natural Card sample of Palace Maps as well\"",
  "\"So far all documented drops have come from Rogue Exiles who are Ranger, Scion, Witch\"",
  "\"drop disabled\"",
  "\"Coves was legacy drop location; may have been reintroduced\\nDivcord: 3.21, Coves verified by Itacheey\"",
  "\"The Shaper's Realm\"",
  "\"Dropped from Park in a Kirac Mission as the stack of cards. Park has no area-specific cards. Perhaps another weird Kirac Mission mechanic?\\nRequires reconfirmation of Park Kirac Map or other tag-less maps\\nAfter more testing with Kirac missions - conclusion: dropping The Void from any source completes the mission; may not be Park specific.\"",
  "\"Divcord verified in cells\\n\\nDivcord: No longer drops in Tower (Expected: >100 ; Sample Actual: 0).\"",
  "\"Colonnade verified in divcord\"",
  "\"Toxic Sewer observed by SlipperyJim8 as a Kirac Mission drop\\nSunken city verified in divcord\"",
  "\"no relevant tags, maybe all map Trial zones?\"",
  "\"Stonebeak, Batle Fowl\"",
  "\"Acton's Nightmare\"",
  "\"Lighthouse verified in divcord\\nPlateau verified in divcord\\nDivcord: Summit verified by RiPHeartofGold 3.19\"",
  "\"3.21: The Witch can now be found in the The Putrid Cloister, Sepulchre, Waste Pool, and Phantasmagoria Maps.\\nThese Areas all received the new doedre_map_area Tag. They are the only four Areas with that Tag.\"",
  "\"Divcord: T7 Crystal Ore verified by Zimzams\\nDivcord: Geode verified -> mine_area\\nExcavation, Dig verified in Divcord\\n3.20 patch notes: Added Grotto\\n\\nDivcord: [Story] 3.21, A9 The Quarry verified by Zimzams\"",
  "\"Verified Uber Lab+ - Izaro's Treasure, Curious Lockbox, Labyrinth Trove by SuitSizeSmall and Divcord\\nDivcord verified also Silver Key caches\"",
  "\"Divcord also verified this in Caer Blaidd, which has `den_area` but not `rigwald_area`\\n\\nNeeds verification for Barrows and Grotto if actually den_area\\n\\nDivcord: Dark Forest verified by Zimzams\\n\\nZimzams ran sufficient Grotto to obtain 82 Loyalty while observing 0 The Wolf's Shadow ; expected:14; actual 0. This sufficiently falsifies `den_area`.\\n\\nCould be rigwald_area + Caer Blaidd, or alternatively, \\\"Wolf\\\" boss + area drop.\"",
  "\"Originally, both goatman_boss_area and snow_mountain_area returned the same set of Maps; with Story drops, goatman_boss_area is more likely, but this is not sufficient to explain drops in Lair\\n\\nLair has neither `goatman_boss_area` nor `snow_mountain_area`, which means that either hypothesis is incomplete.\\nThe Wolverine is probably enabled by multiple different rules.\"",
  "\"3.20 patch notes: Added Lair; if Volcano gains snow_mountain_area, may indicate another combo for Lair to fit.\\n\\nLair has neither `goatman_boss_area` nor `snow_mountain_area`, which means that either hypothesis is incomplete.\\nThe Wolverine is probably enabled by multiple different rules.\\nThe lack of patch-note mention of The Wolverine in Dark Forest rules out a lot of single-tags for Lair as well.\\n\\nden_area + cave_area returns Lair, Grotto and Caer Blaidd\\n(den_area OR cave_area) + rigwald_area returns only Lair\\nNo observations in Grotto in 3.20 (n=1613) or Caer Blaidd (n=88)\\nNot in Dark Forest either.\"",
  "\"Cavern of Wrath (Cruel/Merc) is a historical drop location. It was changed without any explanation to Cavern of Anger Act 6 without any data in 2017 by Logopolis01 - likely no longer valid. Likewise, The Canals was added by a deleted user in 2017 - not consistent with current tags.\"",
  "\"Need verifications that these Areas are still eligible for The Wretched in 3.18:\\n{Cells, Dungeon, Mud Geyser, Overgrown Ruin}\\n\\nIf Dungeon is eligible, maybe also `prison_area`\\nIf Overgrown Ruin is eligible, maybe also `chamber_of_sins_area`\\nIf Mud Geyser is eligible, maybe also `fetid_area` or `toxic_pool_area`\\n\\n\\nDivcord: Zimzams tested Cells, n>200, 0 The Wretched -- no longer drops in Cells.\\nDivcord: 3.20, Zimzams tested Dungeon, n=288, 0 The Wretched -- no longer drops in Dungeon (conf>>99.9%).\\nDivcord: 3.20, Overgrown Ruin, n=95, 0 The Wretched -- no longer drops in Overgrown Ruin (conf>99.9%).\"",
  "\"Similar to the situation with Grave Knowledge and The Forsaken, Necropolis seems to drop anything which can appear in crypt_area even though it doesn't have that Tag - see necropolis_area quirk.\"",
  "\"In the past, The Wretched was eligible in Mud Geyser. The claim on the wiki is stale, however, and Mud Geyser has not been reverified in a long time. It's likely it is no longer an eligible Area.\\n\\nDivcord 3.20: testing Bog which is on-Atlas and shares Tags with Mud Geyser (fetid_area, toxic_pool_area). No The Wretched in Bog, confidence >99.9%, so those Tags can't be it.\\n\\nThe only options are:\\n1) The Wretched no longer drops in Mud Geyser either; or\\n2) Mud Geyser's special exclusive Tag mud_geyser_area is another eligibility-grantor.\"",
  "\"Scriptorium verified in divcord\"",
  "\"Arsenal and Factory added - not sure what \\\"hidden_monster\\\" is.\\nTag clash with The Marketplace (Act 3) and The Imperial Fields (Act 8) - reverify/disprove.\\nThe Marketplace may be a remnant of the old \\\"The Warehouse District\\\". Cannot be \\\"marketplace_area\\\" or \\\"urban_sarn_area\\\".\"",
  "\"Divcord: Viunktar verified\"",
  "\"Expedition Logbooks; Flooded Mine; Excavation\\n\\nDivcord: Crystal Ore verified by Tebec\\nDivcord: Geode verified\\n\\nBesides the Expedition Areas, maybe also mine_area? That would cover Crystal Ore and the legacy location of Excavation. We would need verifications in {Dig, Flooded Mine, Geode}. Dig would distinguish it from cave_area.\\n\\nVerified Dig\\n3.20 patch notes: Added Grotto\"",
  "\"Also found in all Expedition Areas; any Tag or Area relationship for these...?\"",
  "\"Divcord: Peninsula verified\\nPeninsula was legacy drop location; may have been reintroduced\\n\"",
  "\"Caer Blaidd, Wolfpack's Den, Excavation, and Lair were legacy drop locations; may have been reintroduced\\n\\nfal verified Lair on Divcord\\nDivcord: Fungal Hollow verified by nennas\\njas verified Maze of the Minotaur on Divcord\\nTreasure Hunter reported in Caer Blaidd by krolya\"",
  "\"drop disabled\"",
  "\"Uber Atziri was original report\\nUnverified from Incursion Atziri\\nT13 Maps? - disproved in T13 Volcano; might be drop capped to 80? unclear what Bex is referring to in her tweet\"",
  "\"Story only? Drop capped.\"",
  "\"Divcord: nennas verified Pit of the Chimera.\\nDivcord: Zimzams ran Cells, n=578 without seeing any Unchained.\\nDivcord: Pit confirmed by Jate\\n\\nThe Dungeon and Pen claims were older claims on the wiki, from 2021. The prison_area association was only based on those prior observations. I don't think we've seen any reverifications of Dungeon or Pen for Unchained in 3.18.\\n\\nIn fact, besides nennas's verified find in Pit of the Chimera, there was also Pold's tentative find in Arena, though Pold was hesitant about it because the Monster might have been Empowered by a Sentinel (albeit not with a Sentinel with a Divination Card Mod).\\nIf Pold's find was not caused by a Sentinel, then `pitfight_area` might be a fit.\\n\\n\\nStill need the following verifications to confirm `pitfight_area`:\\n{Colosseum}\\n\\nRe-testing Dungeon/Pen might reveal whether or not multiple Tags apply in this case; if not, then `pitfight_area` may be the sole Tag now\\nDivcord: 3.20 Zimzams tested Dungeon with n=288; zero drops of Unchained.\\nDivcord: 3.20, NcuriousmediatoR reports a drop of Unchained from Colosseum, while running Eater (which cannot produce Cards that drop Corrupted Items, so wouldn't be able to be an Eldritch Altar false-positive).\\nDivcord: 3.20, Zimzams verified Unchained in Colosseum.\"",
  "\"Delve Interactables behind Fractured Wall\"",
  "\"Reported from Maze map and Temple of Decay 1, and verified in Vaal Pyramid\\n\\nProhibited Library: HotPocketRemix reported finding Unrequited Love in Vaal Temple, 3.19 -- agrees with tag predictions, but no screenshot\\nPOEwiki discord: diamond reported finding in Vaults of Atziri, no timely screenshot\"",
  "\"Vaal Vessel in Vaal Side Areas\"",
  "\"Acid Caverns observed by SlipperyJim8 as a Kirac Mission drop\\nMalformation verified in divcord\\n3.20 patch notes: re-enabled.\\nDivcord: 3.21, A3 The Sewers verified by Elinvynia\"",
  "\"Need to verify Palace and Villa -- if so, then both piety_area and dominus_area might qualify\\n\\nSeems like Vinia's Token cannot drop from Palace, the wiki note there must be out-of-date. (Sampling expected: 52; observed: 0)\"",
  "\"Here's a remark from u/jokey321 of Void of the Elements dropping from Uber Elder:\\nhttps://www.reddit.com/r/pathofexile/comments/pikn9t/i_paid_100_ex_for_73_uber_elder_runs_here_are_the/hbqigqw/?context=999\\nThat comment was made during 3.15 Expedition.\\n\\nAnother comment, from u/Minkelol -- Void of the Elements from The Elder (not uber).\\nhttps://www.reddit.com/r/pathofexile/comments/lm1ztg/loot_from_30_normal_elder/gnso4ay/?context=999\\nThis would have been 3.13 Ritual.\\n\\n3.21: Verified drop in The Feared.\"",
  "\"3.20 patch notes: Added Grotto\"",
  "\"lunaris_area ?\\nIf so, this would mean The Twilight Temple & Cold River are eligible\\nOr is Wealth and Power actually a Boss-specific drop?\\nPreviously dropped from Lunaris Temple 2 (Act 8)\\nTwilight Temple is closest to check if suspecting lunaris_area + church; could also be lunaris_area and NOT solaris_area\\n\\nDivcord: Cold River verified by kroIya 3.19\\nCold River has both `lunaris_area` and `solaris_area`, so the presence of the latter does not prohibit it\"",
  "\"snow_area? no leads\"",
  "\"Verified in Moon Temple (including via Kirac Mission)\\nmaybe lunaris_area?\\n\\nDivcord: 3.21, Zimzams ran Cold River with `lunaris_area` and dropped 387 natural Cards with 0 hits of Astral Protection. kroIya did 593 natural Cards in in 3.19, also 0 hits. Combining these samples (and adjusting for ineligible Cards / weights), this is >99.99% confidence that `lunaris_area` alone is insufficient for Astral Protection.\\n\\nDivcord: 3.21, zero hits of Astral Protection in T4 Temple after n=546 natural Card drops. This sample gives >99% confidence that Astral Protection is not a natural Area drop in Temple Map.\\n\\n\\nAstral Protection needs a new hypothesis to explain the verified drops in Moon Temple.\\nWe'd need a drop in a non-Moon-Temple Area to make a new good guess, though.\"",
  "\"verified multiple times in Factory.\\n\\nNo sightings in Arsenal or Silo (warehouse_area).\\nLava Lake and Ashen Wood sightings possibly debunked (altar?)\\nNo sightings in Villa (masked boss theory)\\n\\n3.20, zero hits in Courthouse (n=46; conf >99%), checking \\\"Boss uses Earthquake-based Skill\\\" hypothesis\\n3.20, zero hits in The Vinktar Square (n=34; conf ~99%), considering `lightning_affinity` as well\"",
  "\"Dropped from Jorgin in maps AND safehouse, regardless of choice\\n1 report of Cameria appears to be in error?\"",
  "\"Museum verified in Divcord\\nNot related to incursion most likely\\nCould also be relic_area\\nDivcord: 3.20 Academy verified by Zimzams\\n3.21 Scriptorium verified by Zimzams\"",
  "\"verified on divcord\"",
  "\"Divcord: 3.21, Doryani's Machinarium reported by Silentraz.\\n\\nTheme fits. Doryani's Epiphany being a Unique-Map-specific Card would certainly make sense given the absence of any other valid reports.\\n\\nUnique Map Cards do not necessarily use Tags. The two highest-likelihood options are:\\n1) Doryani's Epiphany is restricted to Doryani's Machinarium.\\n2) Doryani's Epiphany is governed by `vaal_pyramid_area`.\\nOption 1 is probably much more likely.\\n\\nTo falsify Option 2, we'd need big samples in another `vaal_pyramid_area` Area:\\n{Maze, Vaal Pyramid, Vaal Temple, Doryani's Machinarium, Vaults of Atziri}\\n\\n\\nExample: For vaal_pyramid_area => Doryani's Epiphany in T16 Maze:\\n* ~420 natural Card drops on average to obtain one; or\\n* ~2000 natural Card drops with zero observations to disprove with 99% confidence.\\n\\nDivcord: 3.21, Zimzams collected 1131 natural Card drops in T16 Vaal Pyramid, 0 hits.\\nDivcord: 3.21, Elinvynia collected another 919 natural Card drops in Vaal Pyramid, 0 hits.\\nThis is sufficient to rule out `vaal_pyramid_area` with 99% confidence.\\n\\nSeems to be exclusive to Doryani's Machinarium.\"",
  "\"Seen in Vaal Temple\"",
  "\"Divcord: confirmed by razorih and s1rtobi x4\"",
  "\"(Chayula, Uul-Netol, Tul verified), 75+\\nConditions no longer relevant as all Breachstones are now 81+\"",
  "\"Divcord 3.20: Haelroy posts a screenshot showing The Leviathan in T16 Maelstrom of Chaos from a Kirac Mission.\\nCurrent weight estimate: ~33\\n\\nThe Leviathan being limited to Maelstrom of Chaos could explain the lack of reports. If eligible, in the long run, observing 1 The Leviathan would require ~1000 runs of T16 Maelstrom of Chaos (assuming 68% Area IIQ, no Sextants, and 0 Player IIQ).\\nObviously that could be greatly improved by using an MF character and picking good Sextants and pushing Area IIQ. But the general playerbase doesn't do those things. Most players probably run Maelstrom of Chaos at most once per league, likely as soon as they can at a low Tier for early Atlas completion (e.g. T4 this league), and The Leviathan has a Drop Level Requirement of 81 so it's not eligible in low-Tier versions anyway.\\n\\nIf it does indeed drop elsewhere, it will likely correspond to ocean_area, or less likely, map_area_with_open_water.\\nReverified in 3.21 from Maelstrom of Chaos.\"",
  "\"Could be Trialmaster also\\nTentatively spotted from Uber Atziri, no media evidence yet\\n\\nDivcord: Uber Atziri screenshot posted by Hituh 3.19\"",
  "\"Might match `den_area`=>Loyalty due to similar doggo theme?\\n\\nDivcord verifications: Lair, Grotto\\nDivcord: Barrows verified by RiPHeartofGold 3.19\\nLikely unrealistic to confirm in Caer Blaidd due ot rarity\\nCaer Blaidd confirmed by Elinvynia in 3.21\"",
  "\"Uber Elder verified on divcord\"",
  "\"Divcord: 3.20, Cortex verified by Black Mamba\\nThe sole Tag on Cortex is `synthesis_area`\\nAugmented Distant Memory verified by yfeah\\nTwisted Distant Memory verified by Jas\\nAltered Distant Memory, Rewritten Distant Memory verified by Elinvynia\"",
  "\"Divcord: 3.20 verified Spider Forest, Lair, Thicket, Ashen Wood, Dark Forest, Forbidden Woods, Tropical Island\\nDivcord: 3.20, Razgarnok verified Ramparts, Stagnation, Jungle Valley, Bramble Valley\"",
  "\"Divcord: 3.20 Uber Maven, Uber Eater, Uber Exarch verified\\nConfirmed it can drop from non-uber versions of those bosses as well\\nDoki verified Uber Uber Elder.\"",
  "\"Divcord: Claim of Maelstrom of Chaos Boss (Merveil, the Reflection) which has `merveil_boss`\\nDivcord verified: 3.20 Tormented Temptress (Whakawairua Tuahu); Shock and Horror (Mineral Pools); Merveil, the Reflection (Underground Sea); Merveil, the Reflection (Maelstrom of Chaos)\\nVerified Fire and Fury\"",
  "\"Appears to drop in any map generated by Kirac Mission, several confirms.\"",
  "\"Cemetery verified\\nnote: Bramble Valley does not have the bear_boss_map tag despite Melur technically being a bear.\\nDivcord: 3.20 Barrows verified\"",
  "\"Divcord: 3.20 Hillock in Fortification, Research verified\"",
  "\"Divcord: A player reportedly dropped one from Kosis, no screenshot. Consistent with new 3.20 Tag `affliction_boss` and theme -- if true, then Omniphobia should also be eligible. Both need verification. (But the Card will be insanely uncommon!)\\n\\nDivcord: 3.20 Omniphobia verified by MSS on video\\nDivcord: 3.20 Kosis reported by Hatchling13\\nUnlikely to drop from the Deli bosses in Simualcrum due to drop mechanics\"",
  "\"Divcord: 3.20 The Grain Gate verified, A9 The Refinery verified, claim of Arsenal\\nClaim of Factory on reddit\"",
  "\"Divcord: 3.20 Sunken City from a Blight Pump explosion -- likely confirms this as a natural Area drop in `arakaali_area` Areas\\n\\nDivcord: 3.20 Toxic Sewer screenshot by Boltonsquad; Toxic Sewer and Sunken City both have `spider_boss_area`, which may be a governing Tag -- but this may have been \\\"a very unluckily misleading Monster Conversion\\\"\\nTo fully verify `spider_boss_area`, we'd need to observe The Wedding Gift in additional Areas.\\nRemaining verifications for `spider_boss_area`:\\nSpider Lair, Arachnid Nest, Arachnid Tomb, Jungle Valley (off-Atlas for 3.20)\\n\\nDivcord: 3.20, players tested many `spider_boss_area` Areas with no hits of The Wedding Gift. See Divcord for full natural Card drop breakdowns from players' samples. Looking at solely The Web:\\nBambam: 137 The Web in T16 Toxic Sewer\\nSanctia: 295 The Web in T16 Toxic Sewer\\npoorFishwife: 389 The Web in T16 Arachnid Tomb\\nElinvynia: 634 The Web in T16 Jungle Valley\\n\\nThese cannot be directly summed due to different Card weights in those Areas, but it's still very low likelihood that all these attempts would have produced zero The Wedding Gift if `spider_boss_area` were a governing Tag.\\nFor now these conclusions seem solid:\\n* Boltonsquad's drop was \\\"a very unluckily misleading Monster Conversion\\\";\\n* The sole governing Tag for The Wedding Gift is `arakaali_area`, as originally guessed.\\n\\nMaybe we'll get surprised in the future, but for now I think this one should be marked Done.\"",
  "\"Currently we are fairly confident the original tag is arakaali_area, with a lower chance for spider_boss_area. Overgrown Ruin's tags in 3.21 will be key, seems unlikely to get arakaali_area, but more likely to get spider_boss_area, due to Akaveesh (Black Death, Pain Unending). \"",
  "\"Divcord: 3.21, Grave Trough verified by Elinvynia\\nDivcord: 3.21, Graveyard verified by Elinvynia\"",
  "\"Tentative report of a drop in Temple of Decay (not sure which floor)\\nDivcord: Zimzams and Elinvynia tracked >3400 natural Card drops in Overgrown Shrine; no hits.\\n\\nA few reports in 3.21 for Overgrown Ruin, no obvious tags (overlaps Overgrown Shrine, which also has chamber_of_sins_area)\\nDivcord: 3.21, Overgrown Ruin verified by Elinvynia.\\n\\n\\nMaybe it's a connection to Akaveesh (based off of Black Death, Pain Unending), the Unique Spider that Maligaro summons in the Overgrown Ruin and A7 Maligaro's Sanctum Boss fights?\\n* That Monster appears in Overgrown Ruin but not in Overgrown Shrine.\\n* In Story, the Black Venom Quest Item drops from the Spider, not Maligaro.\\n* Black Venom => Poisoned Faith seems like acceptable theming.\\n* Poisoned Faith has a Drop Level Requirement of 53, and A7 Maligaro's Sanctum is Area Level 52.\\n\\nNo standout Monster Tags.\\nMaybe a rule equivalent to something like: \\\"Drops in an Area with a Boss based from `SpiderBossMaligaro`\\\"...?\\nThis would limit eligible Areas to Overgrown Ruin and A7 Maligaro's Sanctum.\\nA natural drop outside these two Areas would rule out this hypothesis.\\n\\nSunken City verified by Elinvynia, indicating a more complex solution.\\nJungle Valley (and spider_boss_area) ruled out.\"",
  "\"Divcord: 3.21, Summit and Glacier verified by Elinvynia\\nDivcord: 3.21, Iceberg verified by Elinvynia\"",
  "\"Potentially also Sporeplume or Peninsula Boss, but unlikely\"",
  "\"Divcord: 3.22, Residence verified by Elinvynia\\nDivcord: 3.22, Academy verified by Elinvynia\""
]